{
  "frontmatter": {
    "draft": false,
    "inprogress": true,
    "dek": "In which we use light and chemicals to make images appear, if we are lucky",
    "date": "2023-01-06T21:50:52.000Z",
    "modified": "2024-06-07T18:19:53.000Z",
    "tags": [
      "analog",
      "photography",
      "process",
      "technique"
    ],
    "hidden": false
  },
  "content": "## Film Development\n\nDeveloping film is an essential part of the analog photography workflow. Whether you're an experienced enthusiast or a beginner, being aware of film development techniques is critical to achieving beautiful prints. In this post, I'll walk you through how I develop my 35mm Black and White film.\n\nFor more on cameras see [[camera-setup]]\n\n### Film I shoot\n- Tri-X 400\n- Ilford HP5 400\n- JCH Streetpan 400\n- Random color film that crosses my path that I never develop\n\n### B&W 35mm Film Development Setup\n\n#setup\n\nTwo rolls must be developed at a time. One time I developed what I thought was 1 roll and it was 2 rolls and I lost a roll of film. RIP. Now developing one roll is forbidden.\n\nOnce you've accumulated 2 matching rolls (no mixing!), the fun can begin:\n\n#### Loading rolls onto film holder\n\n1. Get all materials set up [[step-zero]] and arranged\n2. Put everything inside dark bag\n3. Open up 35mm rolls of film\n4. Cut the ends off and load them onto the plastic film holders\n5. Put the film holders in the development cannister thing\n6. Close everything up so it is light proof\n7. Remove everything (including garbage) from the dark bag\n\n#### Developing rolls of film\n\nIt's important to double-check the film and developer you are using - make sure they are consistent with each other. After you have verified the proper temperature and time of development, slowly pour your developer into the cannister, develop, and dry.\n\n1. Double check the film you are using and the developer [to make sure you are developing at the right temperature for the right amount of time](https://www.digitaltruth.com/devchart.php?Film=Kodak+Tri-X+400&Developer=Ilfosol+3%25&mdc=Search&TempUnits=F&TimeUnits=T)\n2. Get your developer to the right temperature\n3. Pour developer into cannister, follow agitation procedure for your specific film/developer\n4. Pour our developer\n5. Pour in stop bath\n6. Pour out stop bath\n7. Pour in detergent\n8. Leave to wash for a while under the tap\n9. Pour out all water, lightly shake water off rolls\n10. Pull rolls out of film holders\n11. Gently squeegee the rolls to pull drops of water off\n12. Clip film to hang and dry\n13. Try to find a cool picture on the roll while it dries even though you can't see anything\n#### Cutting roll into contact sheet\n1. Once the roll is completely dry, put on some dust or rubber gloves to prevent smudging your negatives\n2. Trim off any excess film, then cut into strips of five photos each\n3. Slip the strips into archival plastic - I recommend rounding the corners of the strips if you want to avoid them getting caught\nThis is where you can start getting excited - anticipation for processing your photos is always the best.\n#### Printing contact sheets\n1. Pick archival sheet of photos\n2. Put in contact sheet holder\n3. Add paper at least 8.5 x 11\n4. Remove any filters from the projector\n5. Make test sheet for contact sheet, at 5 or 10-second intervals\n6. Find the correct exposure time for the contact sheet – the perfect contact sheet has full dark blacks with no shadows and fully white whites with clear detail\n\n### Darkroom Print Setup\n\n#setup\n"
}