{
  "name": "tribulations",
  "description": "no pain no gain. removing the friction from prototyping",
  "url": "https://github.com/enjalot/tribulations",
  "homepage": null,
  "stats": {
    "stars": 2,
    "forks": 0,
    "watchers": 5,
    "openIssues": 0
  },
  "language": "Unknown",
  "languageColor": "#666666",
  "topics": [],
  "readme": {
    "html": "<h1 id=\"tribulations\">tribulations</h1>\n<p>no pain no gain. removing the friction from prototyping</p>\n<h1 id=\"the-problem\">The problem</h1>\n<p>When you are trying to make something new, you often try out many many things. The quicker you try different things out in this new space the more familiar you get with it. When we are coding we often find ourselves in new spaces, new APIs, new features, new ideas. How can we make an environment that lets us try more things?</p>\n<h1 id=\"goals\">Goals</h1>\n<p>We aim to create a prototyping environment for the web that lets you <em>try</em> as fast as you can. There should be no friction in getting your idea \"on paper.\" <a href=\"http://vimeo.com/36579366\">Ideas are fragile</a> so we need tools that help them survive a difficult birth. We must also not be afraid to throw them away and make new ones, we need an environment that removes the guilt of killing an idea so you can try a new one.</p>\n<h1 id=\"features\">Features</h1>\n<ul>\n<li><em>History</em> - everything you make has a complete history starting from the first keystrokes.</li>\n<li><em>Search</em> - you can find anything you made before, so don't worry about stopping to save or even think before creating something new.</li>\n<li><em>Collaboration</em> - you can share what you are working on with a url, that url could be loaded by another person, another device or even another monitor.</li>\n<li><em>Tools</em> - you should be able to augment your environment with new tools that free up your brain to think about the problem at hand, not wastefully repeating the same ritual steps to get things going.</li>\n</ul>",
    "raw": "tribulations\n============\n\nno pain no gain. removing the friction from prototyping\n\n\n# The problem\nWhen you are trying to make something new, you often try out many many things. The quicker you try different things out in this new space the more familiar you get with it. When we are coding we often find ourselves in new spaces, new APIs, new features, new ideas. How can we make an environment that lets us try more things?\n\n# Goals\nWe aim to create a prototyping environment for the web that lets you *try* as fast as you can. There should be no friction in getting your idea \"on paper.\" [Ideas are fragile](http://vimeo.com/36579366) so we need tools that help them survive a difficult birth. We must also not be afraid to throw them away and make new ones, we need an environment that removes the guilt of killing an idea so you can try a new one.\n\n# Features\n* _History_ - everything you make has a complete history starting from the first keystrokes.  \n* _Search_ - you can find anything you made before, so don't worry about stopping to save or even think before creating something new.  \n* _Collaboration_ - you can share what you are working on with a url, that url could be loaded by another person, another device or even another monitor.\n* _Tools_ - you should be able to augment your environment with new tools that free up your brain to think about the problem at hand, not wastefully repeating the same ritual steps to get things going.\n",
    "excerpt": "tribulations\n============\n\nno pain no gain. removing the friction from prototyping\n\n\n\nWhen you are trying to make something new, you often try out many many thi..."
  },
  "createdAt": "2014-12-13T21:11:02Z",
  "updatedAt": "2015-08-22T08:31:23Z",
  "pushedAt": "2014-12-13T21:23:46Z"
}