{
  "content": "<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">The snow is beginning to fall in upstate New York and I am gathering some fresh wood from the pile by the driveway to put next to the wood stove. All winter long, warmth has been hard to find. Lately, despite how cold it is, I have been resisting the urge to light the fire until the sunset lights up the trees. As I feel the temperature drop, I <em class=\"\">finally</em> let myself light the fire. I apply the lighter to the carefully designed structure of kindling, which is eager to burn, so I only have to hold the flame to it for a few seconds. Then I can sit back and watch the fire grow.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">There is a pride, an inner warmth you gain when you sit by a fire you've assembled yourself. Within that pride is gratitude to the tree that is itself burning, the nameless stewards of that tree throughout its lifetime, the person who cut it down, chopped it, and dumped it in your driveway, and gratitude to your parents for making that order in mid-July in preparation for the cold winter.</p>\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"preparation\">Preparation</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">For the past year when I wake up in the morning and meditate for a little while on what my heart truly desires the compass often spins back to a central concept of <strong class=\"\">preparation</strong>. <em class=\"\">The process of assembling skills, knowledge, and tools that may or may not be useful later.</em> This is a dangerous art that can quickly trap a person. You can easily become over-enamored with preparation as an act in itself, something I keep falling prey to.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I have been trying to find the commonalities, the patterns in the things I feel drawn to, but even within myself it is sometimes hard to figure out. It is probably easier to catalog the things and let the threads draw themselves.</p>\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"my-profound-love-of-bags-containers-and-minimalism\">My Profound Love of Bags, Containers, and Minimalism</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I have finally admitted and come to love a fundamental part of myself; I love bags. I love having the right containers for things, everything having a place, and building myself a mobile system. After hiking a few miles, sitting next to river, I want to be able to pull the right thing out of my pack in a few seconds. A lot of my everyday items; flashlight, gloves, etc live in my bag so reaching for them is second-nature, practiced everyday.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">This could be a response to the constraints of my life; I’ve been bouncing around trying to find a semi-permanent place in Beacon, NY while trying to avoid being entangled in the insane post-COVID Hudson Valley housing market.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I love traveling by motorcycle as long as the weather permits, and my setup is built around being loaded onto a bike and driven through rainstorms. This means everything needs to be in dry bags, carefully protected from the elements. The motorcycle makes you really think through the things you want to carry; space is limited, and every object needs to be useful in at least two ways and used every day to justify the space it takes up. I've documented this more on my <a href=\"https://ejfox.com/gear\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"external-link group prose-sm text-blue-600 dark:text-blue-400 hover:underline transition-colors duration-200\">gear page</a></p>\n<img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1731960044/gear-viz.r1.png\" alt=\"https://res.cloudinary.com/ejf/image/upload/v1731960044/gear-viz.r1.png\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1731960044/gear-viz.r1.png 400w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1731960044/gear-viz.r1.png 800w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1731960044/gear-viz.r1.png 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full max-w-full mx-auto transition-all duration-300 ease-in-out pr-2 py-2 md:pr-6 md:py-4 lg:pr-12 lg:py-6 animate-on-scroll slide-from-bottom will-change-transform\">\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I like this way of minimalist thinking about the gear I keep on my person and my bike on two levels; a practical pragmatic level as well as a philosophical and ethical plane.</p>\n<h4 class=\"\" id=\"aesthetically-minimalist\">Aesthetically Minimalist</h4>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I have been a fan, if not an adherent, of a minimalist design philosophy for my entire adult life. I was raised in a generation of designers who admired Dieter Rams and Edward Tufte; as a data visualization designer I was taught early about the concept of “data-ink ratio”; that is, the ink on the page needs to justify itself with information conveyed. In this view, elements on a page (or a screen) that do not serve a justifiable utilitarian purpose need be removed in order to <em class=\"\">grant clarity to the user</em>. The minimalism is in aid of understanding and truth, and through good design is the result of careful thought and iteration on the part of the designer in order to save the user precious time and frustration.</p>\n<h4 class=\"\" id=\"philosophically-minimalist\">Philosophically Minimalist</h4>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I want to have fewer things; in order to form less attachment, in order to better enjoy the world around me, and to divest from the pain of entropy. Possessions come and go, and the urge to hoard resources comes from a place of pain and fear that I do not want to dwell in.</p>\n<h4 class=\"\" id=\"pragmatically-minimalist\">Pragmatically Minimalist</h4>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">You cannot take from me what I do not have, and it is in this vein that teaching myself to be self-sufficient and rely on less feels a lot more like investing in my own freedom. The motorcycle is a lighter, smaller vehicle that requires less gas to go further, which makes me both less reliant on the fossil fuels that are burning up our planet, as well as able to financially withstand fluctuations in fuel prices.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">My real re-introduction to the Hudson Valley came through a pandemic-driven purchase of a a motorcycle (a 150cc Honda Grom) and then, a year later, another (a 300cc Kawasaki Versys X) and zipping up and down 9D and up and around Bear Mountain to Perkins Lookout I thought to myself “holy shit, this was here the whole time?”</p>\n<img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733760764/arena/arena-32817026.jpg\" alt=\"https://res.cloudinary.com/ejf/image/upload/v1733760764/arena/arena-32817026.jpg\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1733760764/arena/arena-32817026.jpg 400w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733760764/arena/arena-32817026.jpg 800w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1733760764/arena/arena-32817026.jpg 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full max-w-full mx-auto transition-all duration-300 ease-in-out pr-2 py-2 md:pr-6 md:py-4 lg:pr-12 lg:py-6 animate-on-scroll slide-from-bottom will-change-transform\">\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"hidden-communities\">Hidden Communities</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">The initial realization that I lived in a place with world-class motorcycle rides manifested in wanting to spend every single moment that someone wasn’t paying me to write code on my motorcycle, trying out roads I had never been on before, learning both this new tool with it’s strange levers and culture and danger, as well as re-learning the dips and valleys and small town delis that dot New York State from the capitol region to the open farms of Western New York as my journeys brought me out to visit friends in Ithaca or Geneseo.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">They don’t really tell you this before you become a motorcyclist, but we all wave at each other. It’s less a “hey!” and more of a blessing, “don’t die- it’s dangerous out here” and you don’t realize how many motorcycles are out there until you find yourself dropping 2 fingers for the 20th time in a day– you find yourself part of something bigger, something that existed silently until I began to learn the things to look for.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">When you look at a map at you see a mountain with curvy roads, you can almost guarantee a fun ride where you can bend into the turns and shift into the perfect gear, and somewhere at the peak, on a nice weekend morning, you’ll find a bunch of people just like you who like to go fast and have found a unique path to a thing that brings all of you joy. This is what is means to be human, you might think to yourself, however briefly.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Since I moved back to the Hudson Valley, where I grew up, from the city where I spent my 20s, I have been on a journey of rediscovering the beauty and majesty of the place I have the privilege of living. Growing up, New York City rightfully had the strongest center of gravity and I found myself spending a lot of time at various MTA and NJT stations, learning the times when the trains run express, and occasionally missing the last train home and having to explore Secaucus for hours waiting to go home, which a person should really only need to do once.</p>\n<img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733093033/arena/arena-10075114.jpg\" alt=\"https://res.cloudinary.com/ejf/image/upload/v1733093033/arena/arena-10075114.jpg\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1733093033/arena/arena-10075114.jpg 400w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733093033/arena/arena-10075114.jpg 800w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1733093033/arena/arena-10075114.jpg 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full max-w-full mx-auto transition-all duration-300 ease-in-out pr-2 py-2 md:pr-6 md:py-4 lg:pr-12 lg:py-6 animate-on-scroll slide-from-bottom will-change-transform\">\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">After reading <a href=\"https://crimethinc.com/2024/11/13/after-the-hurricane-anarchist-disaster-response-in-appalachia\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"external-link group prose-sm text-blue-600 dark:text-blue-400 hover:underline transition-colors duration-200\">some dispatches from North Carolina</a> after Hurricane Helene and <a href=\"https://www.youtube.com/watch?v=qWV9dtgrcEA\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"external-link group prose-sm text-blue-600 dark:text-blue-400 hover:underline transition-colors duration-200\">the wildfires in LA</a><svg class=\"inline-block w-4 h-4 ml-1 opacity-50 dark:opacity-75 group-hover:opacity-100 transition-opacity\" xmlns=\"http://www.w3.org/2000/svg\" width=\"1em\" height=\"1em\" viewBox=\"0 0 24 24\"><path fill=\"currentColor\" d=\"M23.498 6.186a3.02 3.02 0 0 0-2.122-2.136C19.505 3.545 12 3.545 12 3.545s-7.505 0-9.377.505A3.02 3.02 0 0 0 .502 6.186C0 8.07 0 12 0 12s0 3.93.502 5.814a3.02 3.02 0 0 0 2.122 2.136c1.871.505 9.376.505 9.376.505s7.505 0 9.377-.505a3.02 3.02 0 0 0 2.122-2.136C24 15.93 24 12 24 12s0-3.93-.502-5.814M9.545 15.568V8.432L15.818 12z\" class=\"\"></path></svg> about locals relying on Ham radio for communications. Since then I’ve been using HamStudy to take practice tests and read up and work towards getting licensed.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Part of the desire for a callsign is an exercise in learning new skills; in proving that I can set a goal and put dedication into it and accomplish what I set out to do. Some of the motivation is practice in the meta-skill; learning something uncomfortable by finding systems to understand it. I find this style of self-directed learning profoundly fun and rewarding and very different from anything I experienced in our schooling system.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">After some early studying, I began acquiring cheap radios, first the obligatory Baofengs, but recently a TIDRADIO H3 which has fun features like a nice bright screen and bluetooth support. But I also stumbled on a little community using hacked firmware on it created by one guy essentially reverse-engineering the hardware on his own. In the mornings I tune the radio to the local NPR station; WAMC (91.7FM) and the local repeater NF2ZC (146.97Mhz) on Mt. Beacon and was pleasantly surprised to find an active community of folks checking in from Poughkeepsie to Florida, NY.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I love knowing that hidden on radio waves that permeate this valley, there’s a group of people talking about their breakfast and practicing passing messages both for their own benefit as well as to potentially help the community more broadly in case of an emergency. These people are assuredly all different, with different ideas about what an ideal future holds, but for this thing they can come together and agree.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">We are living in a moment of remarkable instability and uncertainty, politically and technologically. The threatening wave of techno-fascism paired with paradigm changes promised by AI mean the future will certainly be radically different. The ways in which it will be different are still within our control, to some degree, particularly in the small hidden local networks that exist all around us if we know where to look.</p>\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"packing-light\">Packing Light</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Packing light for the motorcycle teaches me to look at not just my possessions but also my skill and my time through a discerning lens. Life is short, and I’m reminded how close to death I am almost every time I ride, if you don’t you get complacent. Hubris and complacency have been the end of much better men than me.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">When I’m evaluating how to spend my time, whether I want to go bowling or read a book and practice my knots, I’m thinking about building a library of skills and knowledge that not only compliment each other, but also spark joy for me, and through that give me “free fuel” to learn and push myself through difficult parts of the learning process.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">But I am also grateful for how good it feels to finally put a skill you have practiced many times over into real utility. To have prepared for a moment so well that you don’t have to think, that your tools are right where you need them, and you can just execute. The majesty in those moments can justify almost any pain or boredom in the preparation, for me. The art of guessing, realistically what those things might be is its own art, akin to threat modeling. Much of it comes through practice and experience, and as frustrating as that is, so much of what works for me is highly personal and the ways in which it is specific to my own personality and choices is intrinsic to the value it brings to me.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">A lot of my gear isn’t just for me; I carry extras of items that others might need, I carry a first aid kit in order to help the people I am surrounded by, I have enough extra old gear in my storage unit to outfit another person completely. The same can be said for my skills; which I have assembled in a way that will hopefully benefit myself and those around me. Wilderness first aid, the ability to fix electronics, even just being able to take a good photo. As someone who finds joy through service, this brings its own innate reward, but it also comes from knowing the responsibility I owe to my community and to the place I am lucky enough to live.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Putting in the effort to gather and prepare the fire isn’t just about warming oneself, it’s about making a place of warmth for others. There is something fundamentally human in these acts; these are the moments when some see God move through us, when we are kind to each other for no gain, something beautiful that lives in the hearts of almost everyone if you have faith. These are things worth protecting, worth preparing to protect.</p>",
  "html": "<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">The snow is beginning to fall in upstate New York and I am gathering some fresh wood from the pile by the driveway to put next to the wood stove. All winter long, warmth has been hard to find. Lately, despite how cold it is, I have been resisting the urge to light the fire until the sunset lights up the trees. As I feel the temperature drop, I <em class=\"\">finally</em> let myself light the fire. I apply the lighter to the carefully designed structure of kindling, which is eager to burn, so I only have to hold the flame to it for a few seconds. Then I can sit back and watch the fire grow.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">There is a pride, an inner warmth you gain when you sit by a fire you've assembled yourself. Within that pride is gratitude to the tree that is itself burning, the nameless stewards of that tree throughout its lifetime, the person who cut it down, chopped it, and dumped it in your driveway, and gratitude to your parents for making that order in mid-July in preparation for the cold winter.</p>\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"preparation\">Preparation</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">For the past year when I wake up in the morning and meditate for a little while on what my heart truly desires the compass often spins back to a central concept of <strong class=\"\">preparation</strong>. <em class=\"\">The process of assembling skills, knowledge, and tools that may or may not be useful later.</em> This is a dangerous art that can quickly trap a person. You can easily become over-enamored with preparation as an act in itself, something I keep falling prey to.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I have been trying to find the commonalities, the patterns in the things I feel drawn to, but even within myself it is sometimes hard to figure out. It is probably easier to catalog the things and let the threads draw themselves.</p>\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"my-profound-love-of-bags-containers-and-minimalism\">My Profound Love of Bags, Containers, and Minimalism</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I have finally admitted and come to love a fundamental part of myself; I love bags. I love having the right containers for things, everything having a place, and building myself a mobile system. After hiking a few miles, sitting next to river, I want to be able to pull the right thing out of my pack in a few seconds. A lot of my everyday items; flashlight, gloves, etc live in my bag so reaching for them is second-nature, practiced everyday.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">This could be a response to the constraints of my life; I’ve been bouncing around trying to find a semi-permanent place in Beacon, NY while trying to avoid being entangled in the insane post-COVID Hudson Valley housing market.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I love traveling by motorcycle as long as the weather permits, and my setup is built around being loaded onto a bike and driven through rainstorms. This means everything needs to be in dry bags, carefully protected from the elements. The motorcycle makes you really think through the things you want to carry; space is limited, and every object needs to be useful in at least two ways and used every day to justify the space it takes up. I've documented this more on my <a href=\"https://ejfox.com/gear\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"external-link group prose-sm text-blue-600 dark:text-blue-400 hover:underline transition-colors duration-200\">gear page</a></p>\n<img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1731960044/gear-viz.r1.png\" alt=\"https://res.cloudinary.com/ejf/image/upload/v1731960044/gear-viz.r1.png\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1731960044/gear-viz.r1.png 400w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1731960044/gear-viz.r1.png 800w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1731960044/gear-viz.r1.png 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full max-w-full mx-auto transition-all duration-300 ease-in-out pr-2 py-2 md:pr-6 md:py-4 lg:pr-12 lg:py-6 animate-on-scroll slide-from-bottom will-change-transform\">\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I like this way of minimalist thinking about the gear I keep on my person and my bike on two levels; a practical pragmatic level as well as a philosophical and ethical plane.</p>\n<h4 class=\"\" id=\"aesthetically-minimalist\">Aesthetically Minimalist</h4>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I have been a fan, if not an adherent, of a minimalist design philosophy for my entire adult life. I was raised in a generation of designers who admired Dieter Rams and Edward Tufte; as a data visualization designer I was taught early about the concept of “data-ink ratio”; that is, the ink on the page needs to justify itself with information conveyed. In this view, elements on a page (or a screen) that do not serve a justifiable utilitarian purpose need be removed in order to <em class=\"\">grant clarity to the user</em>. The minimalism is in aid of understanding and truth, and through good design is the result of careful thought and iteration on the part of the designer in order to save the user precious time and frustration.</p>\n<h4 class=\"\" id=\"philosophically-minimalist\">Philosophically Minimalist</h4>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I want to have fewer things; in order to form less attachment, in order to better enjoy the world around me, and to divest from the pain of entropy. Possessions come and go, and the urge to hoard resources comes from a place of pain and fear that I do not want to dwell in.</p>\n<h4 class=\"\" id=\"pragmatically-minimalist\">Pragmatically Minimalist</h4>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">You cannot take from me what I do not have, and it is in this vein that teaching myself to be self-sufficient and rely on less feels a lot more like investing in my own freedom. The motorcycle is a lighter, smaller vehicle that requires less gas to go further, which makes me both less reliant on the fossil fuels that are burning up our planet, as well as able to financially withstand fluctuations in fuel prices.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">My real re-introduction to the Hudson Valley came through a pandemic-driven purchase of a a motorcycle (a 150cc Honda Grom) and then, a year later, another (a 300cc Kawasaki Versys X) and zipping up and down 9D and up and around Bear Mountain to Perkins Lookout I thought to myself “holy shit, this was here the whole time?”</p>\n<img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733760764/arena/arena-32817026.jpg\" alt=\"https://res.cloudinary.com/ejf/image/upload/v1733760764/arena/arena-32817026.jpg\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1733760764/arena/arena-32817026.jpg 400w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733760764/arena/arena-32817026.jpg 800w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1733760764/arena/arena-32817026.jpg 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full max-w-full mx-auto transition-all duration-300 ease-in-out pr-2 py-2 md:pr-6 md:py-4 lg:pr-12 lg:py-6 animate-on-scroll slide-from-bottom will-change-transform\">\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"hidden-communities\">Hidden Communities</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">The initial realization that I lived in a place with world-class motorcycle rides manifested in wanting to spend every single moment that someone wasn’t paying me to write code on my motorcycle, trying out roads I had never been on before, learning both this new tool with it’s strange levers and culture and danger, as well as re-learning the dips and valleys and small town delis that dot New York State from the capitol region to the open farms of Western New York as my journeys brought me out to visit friends in Ithaca or Geneseo.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">They don’t really tell you this before you become a motorcyclist, but we all wave at each other. It’s less a “hey!” and more of a blessing, “don’t die- it’s dangerous out here” and you don’t realize how many motorcycles are out there until you find yourself dropping 2 fingers for the 20th time in a day– you find yourself part of something bigger, something that existed silently until I began to learn the things to look for.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">When you look at a map at you see a mountain with curvy roads, you can almost guarantee a fun ride where you can bend into the turns and shift into the perfect gear, and somewhere at the peak, on a nice weekend morning, you’ll find a bunch of people just like you who like to go fast and have found a unique path to a thing that brings all of you joy. This is what is means to be human, you might think to yourself, however briefly.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Since I moved back to the Hudson Valley, where I grew up, from the city where I spent my 20s, I have been on a journey of rediscovering the beauty and majesty of the place I have the privilege of living. Growing up, New York City rightfully had the strongest center of gravity and I found myself spending a lot of time at various MTA and NJT stations, learning the times when the trains run express, and occasionally missing the last train home and having to explore Secaucus for hours waiting to go home, which a person should really only need to do once.</p>\n<img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733093033/arena/arena-10075114.jpg\" alt=\"https://res.cloudinary.com/ejf/image/upload/v1733093033/arena/arena-10075114.jpg\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1733093033/arena/arena-10075114.jpg 400w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1733093033/arena/arena-10075114.jpg 800w,\n      https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1733093033/arena/arena-10075114.jpg 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full max-w-full mx-auto transition-all duration-300 ease-in-out pr-2 py-2 md:pr-6 md:py-4 lg:pr-12 lg:py-6 animate-on-scroll slide-from-bottom will-change-transform\">\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">After reading <a href=\"https://crimethinc.com/2024/11/13/after-the-hurricane-anarchist-disaster-response-in-appalachia\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"external-link group prose-sm text-blue-600 dark:text-blue-400 hover:underline transition-colors duration-200\">some dispatches from North Carolina</a> after Hurricane Helene and <a href=\"https://www.youtube.com/watch?v=qWV9dtgrcEA\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"external-link group prose-sm text-blue-600 dark:text-blue-400 hover:underline transition-colors duration-200\">the wildfires in LA</a><svg class=\"inline-block w-4 h-4 ml-1 opacity-50 dark:opacity-75 group-hover:opacity-100 transition-opacity\" xmlns=\"http://www.w3.org/2000/svg\" width=\"1em\" height=\"1em\" viewBox=\"0 0 24 24\"><path fill=\"currentColor\" d=\"M23.498 6.186a3.02 3.02 0 0 0-2.122-2.136C19.505 3.545 12 3.545 12 3.545s-7.505 0-9.377.505A3.02 3.02 0 0 0 .502 6.186C0 8.07 0 12 0 12s0 3.93.502 5.814a3.02 3.02 0 0 0 2.122 2.136c1.871.505 9.376.505 9.376.505s7.505 0 9.377-.505a3.02 3.02 0 0 0 2.122-2.136C24 15.93 24 12 24 12s0-3.93-.502-5.814M9.545 15.568V8.432L15.818 12z\" class=\"\"></path></svg> about locals relying on Ham radio for communications. Since then I’ve been using HamStudy to take practice tests and read up and work towards getting licensed.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Part of the desire for a callsign is an exercise in learning new skills; in proving that I can set a goal and put dedication into it and accomplish what I set out to do. Some of the motivation is practice in the meta-skill; learning something uncomfortable by finding systems to understand it. I find this style of self-directed learning profoundly fun and rewarding and very different from anything I experienced in our schooling system.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">After some early studying, I began acquiring cheap radios, first the obligatory Baofengs, but recently a TIDRADIO H3 which has fun features like a nice bright screen and bluetooth support. But I also stumbled on a little community using hacked firmware on it created by one guy essentially reverse-engineering the hardware on his own. In the mornings I tune the radio to the local NPR station; WAMC (91.7FM) and the local repeater NF2ZC (146.97Mhz) on Mt. Beacon and was pleasantly surprised to find an active community of folks checking in from Poughkeepsie to Florida, NY.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">I love knowing that hidden on radio waves that permeate this valley, there’s a group of people talking about their breakfast and practicing passing messages both for their own benefit as well as to potentially help the community more broadly in case of an emergency. These people are assuredly all different, with different ideas about what an ideal future holds, but for this thing they can come together and agree.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">We are living in a moment of remarkable instability and uncertainty, politically and technologically. The threatening wave of techno-fascism paired with paradigm changes promised by AI mean the future will certainly be radically different. The ways in which it will be different are still within our control, to some degree, particularly in the small hidden local networks that exist all around us if we know where to look.</p>\n<h3 class=\"prose-sm text-2xl font-medium mb-3 mt-6 max-w-prose md:pr-12 animate-on-scroll slide-from-left\" id=\"packing-light\">Packing Light</h3>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Packing light for the motorcycle teaches me to look at not just my possessions but also my skill and my time through a discerning lens. Life is short, and I’m reminded how close to death I am almost every time I ride, if you don’t you get complacent. Hubris and complacency have been the end of much better men than me.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">When I’m evaluating how to spend my time, whether I want to go bowling or read a book and practice my knots, I’m thinking about building a library of skills and knowledge that not only compliment each other, but also spark joy for me, and through that give me “free fuel” to learn and push myself through difficult parts of the learning process.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">But I am also grateful for how good it feels to finally put a skill you have practiced many times over into real utility. To have prepared for a moment so well that you don’t have to think, that your tools are right where you need them, and you can just execute. The majesty in those moments can justify almost any pain or boredom in the preparation, for me. The art of guessing, realistically what those things might be is its own art, akin to threat modeling. Much of it comes through practice and experience, and as frustrating as that is, so much of what works for me is highly personal and the ways in which it is specific to my own personality and choices is intrinsic to the value it brings to me.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">A lot of my gear isn’t just for me; I carry extras of items that others might need, I carry a first aid kit in order to help the people I am surrounded by, I have enough extra old gear in my storage unit to outfit another person completely. The same can be said for my skills; which I have assembled in a way that will hopefully benefit myself and those around me. Wilderness first aid, the ability to fix electronics, even just being able to take a good photo. As someone who finds joy through service, this brings its own innate reward, but it also comes from knowing the responsibility I owe to my community and to the place I am lucky enough to live.</p>\n<p class=\"prose-p prose-sm max-w-prose mb-4 leading-relaxed dark:prose-invert animate-on-scroll\" style=\"max-width: 60ch;\">Putting in the effort to gather and prepare the fire isn’t just about warming oneself, it’s about making a place of warmth for others. There is something fundamentally human in these acts; these are the moments when some see God move through us, when we are kind to each other for no gain, something beautiful that lives in the hearts of almost everyone if you have faith. These are things worth protecting, worth preparing to protect.</p>",
  "title": "Preparing For Nothing In Particular",
  "metadata": {
    "date": "2025-01-18T20:39:48.000Z",
    "modified": "2025-01-24T15:28:19.000Z",
    "dek": "In which our Narrator contemplates the Art of Preparation whilst tending to his Wood-stove, discovers Hidden Networks of Motorcyclists and Radio Operators in the Hudson Valley, and arrives at certain Conclusions regarding the Nature of Community and Service",
    "inprogress": true,
    "tags": [
      "personal",
      "motorcycle",
      "hudsonvalley",
      "systemsthinking",
      "process",
      "nature"
    ],
    "words": 2077,
    "images": 3,
    "links": 6,
    "codeBlocks": 0,
    "headers": {
      "h2": 1
    },
    "toc": [
      {
        "text": "Preparing For Nothing In Particular",
        "slug": "preparing-for-nothing-in-particular",
        "level": "h2",
        "children": [
          {
            "text": "Preparation",
            "slug": "preparation",
            "level": "h3",
            "children": []
          },
          {
            "text": "My Profound Love of Bags, Containers, and Minimalism",
            "slug": "my-profound-love-of-bags-containers-and-minimalism",
            "level": "h3",
            "children": []
          },
          {
            "text": "Hidden Communities",
            "slug": "hidden-communities",
            "level": "h3",
            "children": []
          },
          {
            "text": "Packing Light",
            "slug": "packing-light",
            "level": "h3",
            "children": []
          }
        ]
      }
    ],
    "type": "post",
    "sourcePath": "../../../../../code/website2/content/blog/2025/hidden-networks-of-warmth.md",
    "sourceDir": "/Users/ejfox/Library/Mobile Documents/iCloud~md~obsidian/Documents/ejfox/"
  }
}