{
  "frontmatter": {
    "date": "2024-10-12T23:52:50.000Z",
    "modified": "2024-10-12T23:54:15.000Z",
    "hidden": false,
    "draft": false
  },
  "content": "## Command Line Tools\n\n1. [cli-conway](https://github.com/ejfox/cli-conway): ASCII conway's game of life. Drop shapes with keybinds, tend your digital garden in Conway's Game of Life. Keep it alive in a tmux pane as you work. CLI gaming meets ambient productivity tool.\n\n2. [git-status-dash](https://github.com/ejfox/git-status-dash): Get a pretty report of git status for every repo in a directory. Perfect for ~/code/ startup scripts or .zsh mods. Never lose track of your changes across projects again.\n\n3. [cli-ching](https://github.com/ejfox/cli-ching): Book of changes meets modern CLI. Guide for coin throws, hexagram building, and LLM-powered I Ching readings. Bridges the gap between physical ritual and digital interpretation.\n\n5. [cli-ascii-3d](https://github.com/ejfox/cli-ascii-3d): Cyberpunk eye candy for your terminal. Watch 3D shapes rotate in ASCII glory. Multiple 'windows' have different shapes spin at different speeds.\n\n6. [cli-alias-wizard](https://github.com/ejfox/cli-alias-wizard): Your friendly neighborhood alias creator. Forget syntax struggles, especially with args. This wizard guides you through crafting and adding aliases to .zshrc/.bashrc. Simplify your CLI life.\n\n7. [directory-sync-tool](https://github.com/ejfox/directory-sync-tool): Visual CLI syncing made easy. Point at two directories, check the sync status, then confirm. Perfect for Obsidian to GitHub workflows or any directory comparison. Sync with confidence in your terminal.\n\n8. [cli-content](https://github.com/ejfox/cli-content): Your CLI content creation companion. Pulls random drafts from Obsidian, uses AI to suggest improvements, and guides you through transforming drafts into blog posts or videos. Get inspired and productive right from your terminal.\n\n9. [showtouch](https://github.com/ejfox/showtouch): CLI key press visualizer. Show every keystroke in large ASCII art. Perfect for presentations and livestreams. Make your typing a visual spectacle.\n\n10. [ascii_webcam](https://github.com/ejfox/ascii_webcam): Turn your webcam feed into live ASCII art. Real-time conversion for that true hacker aesthetic. Who needs pixels when you have characters?\n\n11. [scrapbook-cli](https://github.com/ejfox/scrapbook-cli): Command-line interface for your digital scrapbook. Explore and manage your collected snippets, notes, and ideas right from the terminal.\n\n12. [cli-delta-dojo](https://github.com/ejfox/cli-delta-dojo): Sharpen your code review skills in the terminal. JSON comparison game to train your eye for changes. Learn while you play in true CLI style."
}