{
  "html": "<h2 class=\"\" id=\"step-zero-get-it-running-locally\">Step Zero: Get It Running Locally</h2>\n<p class=\"\">Before anything else, I need the application running on my machine. This is non-negotiable—you can't really investigate anything until you can see it work. I strongly recommend doing this with someone on a live call. They haven't had to onboard to this system in maybe 6 months or a year, so things that worked when they set up might not work anymore. Your fresh eyes and their institutional knowledge make a powerful debugging combo.</p>\n<h2 class=\"\" id=\"read-the-readme-even-if-it-sucks\">Read the README (Even If It Sucks)</h2>\n<p class=\"\">If it has a README, I read it. Even if it's old, even if a robot wrote it. You don't want to be the idiot asking a question that's answered in the README—even poorly.</p>\n<h2 class=\"\" id=\"front-end-applications-follow-the-user-journey\">Front-End Applications: Follow the User Journey</h2>\n<p class=\"\">For front-end apps, I trace the user's path through the code:</p>\n<p class=\"\"><strong class=\"\">Index → Components → Routing → State → Data</strong></p>\n<ul class=\"list-disc\">\n<li class=\"\">Where's the home page? What does index.js/index.html actually render?</li>\n<li class=\"\">Where are the components organized? What's the folder structure philosophy?</li>\n<li class=\"\">How is routing handled? Custom solution or standard library?</li>\n<li class=\"\">Is there a store? What state management approach?</li>\n<li class=\"\">Is there a database? Can I see the schema? Can I run one locally?</li>\n</ul>\n<p class=\"\">The router is usually my first deep dive—what URLs does this site support? Is there a list of them somewhere?</p>\n<h2 class=\"\" id=\"backend-applications-find-the-scaffolding\">Backend Applications: Find the Scaffolding</h2>\n<p class=\"\">For backend systems, I look for the structural files first:</p>\n<ul class=\"list-disc\">\n<li class=\"\"><strong class=\"\">Makefile</strong> - How do they actually run this thing? What are the common commands?</li>\n<li class=\"\"><strong class=\"\">Dependency file</strong> - package.json, requirements.txt, Gemfile - what libraries am I dealing with?</li>\n<li class=\"\"><strong class=\"\">Docker files</strong> - Dockerfile, docker-compose.yml - how does this thing build? Does it need a database?</li>\n<li class=\"\"><strong class=\"\">Recent activity</strong> - I surf GitHub for recently changed files, active PRs, files with the most recent commits</li>\n</ul>\n<p class=\"\">This gives me the landscape before I start exploring the actual logic.</p>\n<h2 class=\"\" id=\"data-applications-start-at-the-source\">Data Applications: Start at the Source</h2>\n<p class=\"\">For data processing or analysis applications, I start at the top: Where does data come in? What's the source file or API? Is there a file that orchestrates a series of processes or are they run ad-hoc by hand?</p>\n<h2 class=\"\" id=\"the-first-pr-proof-of-concept\">The First PR: Proof of Concept</h2>\n<p class=\"\">My goal is to make a PR on day 1-2. Something super simple—a copy change, a CSS tweak, anything. This isn't about shipping meaningful features yet. It's about proving the entire development process works end-to-end: I can make changes, test them locally, create a PR, get it reviewed, and see it deployed.</p>\n<p class=\"\">This first PR teaches me their deployment process, PR review culture, testing requirements, and any gotchas in their pipeline.</p>\n<h2 class=\"\" id=\"document-what-you-learn\">Document What You Learn</h2>\n<p class=\"\">I'm constantly taking notes and making diagrams—Scapple, Mermaid charts, and increasingly my own tool Connectology. I mirror this internal knowledge back to the subject matter experts in a way that sparks joy for them, which keeps me excited.</p>\n<p class=\"\">These diagrams often reveal inefficiencies or make people say \"yeah, I know it's less than ideal.\" I'm not judging them—constraints create complexity, and every codebase has baggage. But these visualizations might bring value down the line, helping the team see their own system with fresh eyes.</p>\n<h2 class=\"\" id=\"the-secret-talk-to-people-first\">The Secret: Talk to People First</h2>\n<p class=\"\">Here's what most developers miss: you're not just a code detective, you're a people detective. Someone once said \"Never solve problems with technology you can solve by talking to people\"—and this applies doubly to understanding codebases.</p>\n<p class=\"\">The person who built the authentication system can explain in 30 seconds what would take you hours to reverse-engineer. The PM who requested that weird feature can tell you why the code looks hacky (spoiler: it was supposed to be temporary). The designer who created those components can explain the naming conventions that seem random.</p>\n<p class=\"\">You're not just reading code—you're reading the humans who wrote it, the history of the decisions behind them, the constraints they faced, the deadlines they hit, the technical debt they knowingly took on.</p>\n<h2 class=\"\" id=\"your-new-identity-sherlock-holmes-meets-art-therapist\">Your New Identity: Sherlock Holmes Meets Art Therapist</h2>\n<p class=\"\">This process transforms you into something unique: a technical archaeologist who understands that every codebase is ultimately a story about people making decisions under pressure. You're interviewing the system through both its code and its creators.</p>\n<p class=\"\">Most developers think they can figure everything out by reading files. You've learned that the fastest path is usually through conversations. You're not just onboarding to a codebase—you're onboarding to a team's collective knowledge, their unspoken assumptions, their tribal wisdom.</p>\n<p class=\"\"><strong class=\"\">The goal isn't to become an expert in their codebase. It's to become productive fast, contribute meaningfully, and leave things a little better documented than you found them.</strong></p>\n<p class=\"\">Each time you do this, you're not just learning their system—you're expanding your library of both architectural approaches and human patterns. You're becoming fluent in the universal language of \"how teams actually work.\"</p>",
  "title": "How I Get Acquainted With A New Codebase",
  "metadata": {
    "date": "2025-03-05T15:10:06.000Z",
    "modified": "2025-08-29T18:10:02.000Z",
    "tags": ["code", "howto", "process", "coding", "programming", "workflow"],
    "words": 810,
    "images": 0,
    "imageDetails": {
      "total": 0,
      "cloudinary": 0,
      "withDimensions": 0
    },
    "links": 0,
    "codeBlocks": 0,
    "headers": {},
    "toc": [],
    "type": "post",
    "sourcePath": "../../../../../code/website2/content/blog/drafts/how-i-get-acquainted-with-a-new-codebase.md",
    "sourceDir": "/Users/ejfox/Library/Mobile Documents/iCloud~md~obsidian/Documents/ejfox/"
  }
}
