{
  "slug": "reading/Menn-Cult of the Dead Cow",
  "kindle-sync": {
    "bookId": "25545",
    "title": "Cult of the Dead Cow: How the Original Hacking Supergroup Might Just Save the World",
    "author": "Joseph Menn",
    "asin": "B07J54F9KR",
    "lastAnnotatedDate": "2019-07-08",
    "bookImageUrl": "https://m.media-amazon.com/images/I/712GDD7YdOL._SY160.jpg",
    "highlightsCount": 34
  },
  "date": "2022-12-14T20:27:36.000Z",
  "modified": "2022-12-23T16:07:37.000Z",
  "tags": [
    "hackers",
    "tech",
    "culture",
    "activism",
    "security",
    "politics",
    "internet",
    "data"
  ],
  "hidden": false,
  "draft": false,
  "robotsMeta": "index, follow",
  "title": "Cult of the Dead Cow",
  "toc": [
    {
      "text": "Cult of the Dead Cow",
      "slug": "cult-of-the-dead-cow",
      "level": "h1",
      "children": []
    },
    {
      "text": "Metadata",
      "slug": "metadata",
      "level": "h1",
      "children": []
    },
    {
      "text": "Highlights",
      "slug": "highlights",
      "level": "h1",
      "children": []
    }
  ],
  "wordCount": 2032,
  "readingTime": 9,
  "imageCount": 0,
  "linkCount": 36,
  "content": "<p class=\"max-w-prose\" style=\"max-width: 50ch;\">#hackers #tech #culture</p>\n<h1 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\">\n<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 14.81 17.81\" class=\"header-star inline-block mr-2\" width=\"14\" height=\"17\" opacity=\"0.2\">\n  <path d=\"M10.01,5.75c1.18-.82,2.19-1.55,3.22-2.24.48-.32,1.05-.52,1.45.07.39.58-.22.78-.54,1.07-1.15,1.05-2.29,2.12-3.46,3.14-1.61,1.41-1.68,2.82-.12,4.35.44.43.97.78,1.48,1.15.42.3.69.68.51,1.19-.2.58-.69.76-1.28.85-.87.14-1.6-1.14-2.32-.42-.47.48-.41,1.47-.65,2.2-.13.39-.52.6-.91.67-.54.1-.89-.26-1.1-.68-.37-.72-.37-1.45-.11-2.26.29-.91.9-2.19,0-2.72-.56-.33-1.53.82-2.14,1.53-.76.88-1.8,1.51-2.32,2.62-.23.48-.75.58-1.22.35-.67-.31-.56-.89-.31-1.4.71-1.44,1.94-2.43,3.1-3.46,2.66-2.37,2.68-2.36.36-5.11-.5-.6-1.05-1.16-1.57-1.74-.22-.25-.34-.56-.13-.84.2-.27.56-.24.87-.19,1.09.18,1.71,1.01,2.43,1.72.54.54,1.03,1.57,1.74,1.37.82-.24.4-1.36.48-2.08.18-1.48.32-2.95.89-4.33C8.48.27,8.7.01,9.04,0c.48-.01.69.37.72.75.07.93.1,1.87.07,2.81-.02.68-.26,1.36.17,2.19Z\"></path>\n</svg></a>Metadata</h1>\n<ul>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Author: <a href=\"https://www.amazon.com/Joseph-Menn/e/B001HD1MF6/ref=dp_byline_cont_ebooks_1\">Joseph Menn</a></p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">ASIN: B07J54F9KR</p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">ISBN: 154176238X</p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Reference: <a href=\"https://www.amazon.com/dp/B07J54F9KR\">https://www.amazon.com/dp/B07J54F9KR</a></p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\"><a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR\">Kindle link</a></p>\n</li>\n</ul>\n<h1 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\">\n<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 14.81 17.81\" class=\"header-star inline-block mr-2\" width=\"14\" height=\"17\" opacity=\"0.2\">\n  <path d=\"M10.01,5.75c1.18-.82,2.19-1.55,3.22-2.24.48-.32,1.05-.52,1.45.07.39.58-.22.78-.54,1.07-1.15,1.05-2.29,2.12-3.46,3.14-1.61,1.41-1.68,2.82-.12,4.35.44.43.97.78,1.48,1.15.42.3.69.68.51,1.19-.2.58-.69.76-1.28.85-.87.14-1.6-1.14-2.32-.42-.47.48-.41,1.47-.65,2.2-.13.39-.52.6-.91.67-.54.1-.89-.26-1.1-.68-.37-.72-.37-1.45-.11-2.26.29-.91.9-2.19,0-2.72-.56-.33-1.53.82-2.14,1.53-.76.88-1.8,1.51-2.32,2.62-.23.48-.75.58-1.22.35-.67-.31-.56-.89-.31-1.4.71-1.44,1.94-2.43,3.1-3.46,2.66-2.37,2.68-2.36.36-5.11-.5-.6-1.05-1.16-1.57-1.74-.22-.25-.34-.56-.13-.84.2-.27.56-.24.87-.19,1.09.18,1.71,1.01,2.43,1.72.54.54,1.03,1.57,1.74,1.37.82-.24.4-1.36.48-2.08.18-1.48.32-2.95.89-4.33C8.48.27,8.7.01,9.04,0c.48-.01.69.37.72.75.07.93.1,1.87.07,2.81-.02.68-.26,1.36.17,2.19Z\"></path>\n</svg></a>Highlights</h1>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“The cDc people were, at least for the most part, up until the later 1990s, more interested in writing, music, art, and that sort of thing,” Paul said. “The technical issues were subsidiary to that.” He embraced the do-it-yourself publishing culture that overlapped with music and zines like Boing Boing, which morphed from paper to electronic form and is one of the few still around from back in the day. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=306\">306</a> ^ref-45030</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">The political divide in America at the end of the 1960s was the worst until the 2000s, and that helped push phreaking in a radical direction. The phone companies were very clearly part of the establishment, and AT&#x26;T was a monopoly to boot. That made it a perfect target for the antiwar left and anyone who thought stealing from some companies was more ethical than stealing from others. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=347\">347</a> ^ref-3463</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Even before the Dead had their name, they were a part of Ken Kesey’s Merry Pranksters, the eclectic and idealistic group that drove through America to have fun messing with people and to spread the good news about LSD. Another Prankster, visionary writer and marketer Stewart Brand, would also help spread the good news about the coming age of computing. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=393\">393</a> ^ref-49390</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“Humor is one of the great binding things in the world,” Barlow said, and something that cDc shared with the Pranksters was using humor to question the legitimacy of power. As with hackers, Barlow said, “the thing about acidheads is, they think authority is funny.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=404\">404</a> ^ref-6824</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">cDc survived those sweeps because it was more of a social space, a refuge for hackers blowing off steam, than a place to plot actual hacks that ran afoul of the law. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=434\">434</a> ^ref-62805</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">After Stoll complained that hackers should not be free to enter networks to obtain financial histories from the big credit bureaus, Barlow said he was far more bothered that unaccountable corporations had gathered such data in the first place, which he equated with thievery: “Anybody who wants to inhibit that theft with electronic mischief has my complete support.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=465\">465</a> ^ref-3082</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">With informants everywhere, it was hard to build trust, especially online. In person, it was easier. “There were a lot of drugs, a lot of people on acid, but you bond through that,” Bednarczyk said. “Now you have someone you’ve met and trust, and that builds relationships that are pretty strong.” In those relationships, people gave information and received it. Everyone learned more about what was doable and how to do it. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=507\">507</a> ^ref-31534</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“Our main priority is to create and continuously evolve an environment that fosters an atmosphere of dynamic creativity, coupled with access to information and ideas, that present you with a far greater spectrum of possibility.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=543\">543</a> ^ref-44602</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">At least five from cDc were there, including founder Kevin Wheeler and Matt Kelly, all of whom gathered to live-write some of what would be cDc’s two hundredth text file overnight. After slick homages to Phrack, teen girl magazine Tiger Beat, and the Encyclopedia Brown mysteries for kids, the file described the gogo dancers, drugs, and mayhem of the event, as well as telling an absurdist origin story for the cult that involved monster trucks. Not much of that part made sense, yet file #200 would prove the most popular among cDc’s own members. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=557\">557</a> ^ref-19128</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Industries. For those handling information as sensitive as unpublished software flaws, twelve or thirteen was too young to trust. So the more experienced hackers would wait until the 2600 meeting wound down and then head off to a nearby bar for what they called 2621—the meeting of the subset old enough to be served alcohol. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=762\">762</a> ^ref-4707</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Because cDc wanted maximum impact, it needed maximum press. For that to happen, it had to have a touch of evil, Kevin reasoned, the same way a punk or metal band craved condemnation. “The hip press has to love us and the square press has to hate us for this to work. That’s the eternal conflict in society to play off and ride,” he wrote to the group. “The day [evangelist] Pat Robertson says something positive about cDc is the day we’re over. The conflict, the drama is what makes this interesting and worth writing about.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1258\">1258</a> ^ref-46132</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“If your security is not strong enough to stop script kiddies with publicly available tools, then you have no hope of securing your network from professionals waging war,” he wrote. “Wake up people, it’s going to get much, much worse.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1310\">1310</a> ^ref-13854</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">The Chinese government provided the perfect catalyst to push cDc into politics. It hated the free flow of information, a core value of cDc and the hacker movement it helped lead. China also naturally opposed the US government, where some of cDc and many of their friends and relatives worked. And China was doing business with the same companies cDc loved to hate, chief among them Microsoft. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1391\">1391</a> ^ref-14191</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“I knew the arrival of the net was liable to be as powerful in a very negative way as it was powerful in a very positive way. If it was possible for everything to be known for everyone curious about it, it was also going to be possible for just about anyone everywhere to devise turnkey totalitarianism, where they could flip a switch and see everything you are up to.” Barlow wanted to “set cultural expectations,” he said, to strengthen the side of righteousness for the battles to come. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1414\">1414</a> ^ref-46453</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">For all its calculated omissions and excesses of passion, Barlow’s howl resonated with a burgeoning crowd of technologists, aspirants, and consumers who badly wanted the government to do anything other than screw up the greatest invention of their lifetimes. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1420\">1420</a> ^ref-61602</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">A key idea was citing not just the Universal Declaration of Human Rights, which was nonbinding, but also the International Covenant on Civil and Political Rights, which was less well-known but had the force of a treaty. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1610\">1610</a> ^ref-2182</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">But the culture of the unkempt rebels in the rank and file clashed with that of the suits making sales pitches and controlling the budget. Sketchy pasts and big personalities abounded. Some employees missed a major customer meeting because they had been up all night doing drugs. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1712\">1712</a> ^ref-45838</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">The analyst asked for the street address of the café. When Rodriguez told him exactly where he was, the analyst laughed. “No problem, you don’t have to send anything,” he explained. “Back Orifice is on all of those machines.” To signal where he wanted Rodriguez to sit, he remotely ejected the CD tray from one machine. Then he read everything Rodriguez wrote as he typed out the best on-the-ground reporting from Beijing. Rodriguez erased what he had typed and walked out, leaving no record of the writing. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1778\">1778</a> ^ref-38351</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“It occurs to me how severely the trajectory of my own career has taken me from idealistic anarchist, to corporate stooge, to ambitious entrepreneur, to military/intelligence/defense/law enforcement adviser,” wrote one. “Many cyber guys started out somewhere completely different and then somehow found themselves in the center of the military-industrial complex in ways they would never have been prepared for.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1829\">1829</a> ^ref-43595</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">And when they ran out of ideas, they rented out their botnets to strangers who could try other tricks. On top of all that, international espionage was kicking into higher gear, sometimes with allies in the criminal world aiding officials in their quests. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1871\">1871</a> ^ref-63709</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Careful thought went into what tasks they took on and for whom. “We were pirates, not mercenaries,” Beck said. “Pirates have a code.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1884\">1884</a> ^ref-10950</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Going deeper, Snyder argued that criminals would target Apple users less if the company held less data about them. But more data also made for a seamless user experience, a dominant theme at Apple, and executives kept pressing Snyder for evidence that consumers cared. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1894\">1894</a> ^ref-13786</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">In large part due to Snyder, Apple implemented new techniques that rendered iPhones impenetrable to police and to Apple itself, to the great frustration of the FBI. It was the first major technology company to declare that it had to consider itself a potential adversary to its customers, a real breakthrough in threat modeling. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1897\">1897</a> ^ref-64901</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“It was a time of moral reckoning. People realized the power that they had,” Song said. Hundreds of focused tech experts with little socialization, let alone formal ethics training, were suddenly unleashed, with only a few groups and industry rock stars as potential role models and almost no open discussion of the right and wrong ways to behave. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=1944\">1944</a> ^ref-17775</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">He opposed the denial-of-service attacks as censorship, arguing that the cure for bad speech is more speech. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=2247\">2247</a> ^ref-45454</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Davis explained why he thought LulzSec had so much of the public behind it: “What we did was different from other hacking groups. We had an active Twitter (controlled by me), cute cats in deface messages, and a generally playful, cartoonlike aura to our operations. We knew when to start, we knew when to stop, and most of all we knew how to have fun.” — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=2260\">2260</a> ^ref-6470</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">The Russians had the motive to steal US hacking tools, the means to do it, and the opportunity. Russia was also one of the few suspects with so many of its own tools that it could afford to dump those of the US instead of hoarding them for its own use. The timing is particularly interesting, since the NSA dumps began in August 2016, two months after the DNC breach was disclosed. Russia created chaos and distraction inside the agencies best able to find the source of the DNC hack and strike back, helping to paralyze the Obama administration and mute its response. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=2553\">2553</a> ^ref-13774</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Others were beginning to think more about the meaning of free speech when the immediate problem in many countries was not the inability to speak but the propensity to get drowned out by manufactured voices directed by governments and big economic forces. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=2624\">2624</a> ^ref-49628</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Others in cDc, looking at the mixed motives as geopolitical priorities ascended, opted to go back to basics on defense. By making the internet safer for everyone, they could chip away at the unfair advantage the net had been giving to attackers since the beginning. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=2636\">2636</a> ^ref-7405</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">the Defending Digital Democracy project at Harvard’s Kennedy School of Government, — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=3042\">3042</a> ^ref-1976</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">IN ITS EARLIEST days, the chief moral issues for the teens in the Cult of the Dead Cow were how badly to abuse long-distance calling cards and how offensive their online posts should be. But as they matured, the hackers quickly became critical thinkers in an era when that skill was in short supply. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=3177\">3177</a> ^ref-38704</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">One lesson from the Cult of the Dead Cow’s remarkable story is that those who develop a personal ethical code and stick to it in unfamiliar places can accomplish amazing things. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=3184\">3184</a> ^ref-42717</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Another is that small groups with shared values can do even more, especially when they are otherwise diverse in their occupations, backgrounds, and perspectives. In the early days of a major change, cross sections of pioneers can have an outsize impact on its trajectory. After that, great work can be done within governments and big companies. Other tasks critical for human progress need to be done elsewhere, including small and mission-driven companies, universities, and nonprofits. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=3185\">3185</a> ^ref-18819</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“Security is about how you configure power, who has access to what. That is political,” Song said. — location: <a href=\"kindle://book?action=open&#x26;asin=B07J54F9KR&#x26;location=3211\">3211</a> ^ref-34586</p>\n<hr>"
}