{
  "slug": "reading/Moor-On Trails",
  "kindle-sync": {
    "bookId": "38803",
    "title": "On Trails: An Exploration",
    "author": "Robert Moor",
    "asin": "B0176M3ZG0",
    "lastAnnotatedDate": "2022-03-02",
    "bookImageUrl": "https://m.media-amazon.com/images/I/71QTTsXaDdL._SY160.jpg",
    "highlightsCount": 25
  },
  "date": "2022-12-14T20:24:19.000Z",
  "modified": "2022-12-23T16:05:01.000Z",
  "tags": [
    "travel",
    "maps"
  ],
  "wordCount": 2083,
  "robotsMeta": "index, follow",
  "title": "On Trails",
  "toc": [
    {
      "text": "On Trails",
      "slug": "on-trails",
      "level": "h1",
      "children": []
    },
    {
      "text": "Metadata",
      "slug": "metadata",
      "level": "h1",
      "children": []
    },
    {
      "text": "Highlights",
      "slug": "highlights",
      "level": "h1",
      "children": []
    }
  ],
  "readingTime": 9,
  "imageCount": 0,
  "linkCount": 27,
  "hidden": false,
  "content": "<p class=\"max-w-prose\" style=\"max-width: 50ch;\">#travel #maps</p>\n<h1 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\">\n<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 14.81 17.81\" class=\"header-star inline-block mr-2\" width=\"14\" height=\"17\" opacity=\"0.2\">\n  <path d=\"M10.01,5.75c1.18-.82,2.19-1.55,3.22-2.24.48-.32,1.05-.52,1.45.07.39.58-.22.78-.54,1.07-1.15,1.05-2.29,2.12-3.46,3.14-1.61,1.41-1.68,2.82-.12,4.35.44.43.97.78,1.48,1.15.42.3.69.68.51,1.19-.2.58-.69.76-1.28.85-.87.14-1.6-1.14-2.32-.42-.47.48-.41,1.47-.65,2.2-.13.39-.52.6-.91.67-.54.1-.89-.26-1.1-.68-.37-.72-.37-1.45-.11-2.26.29-.91.9-2.19,0-2.72-.56-.33-1.53.82-2.14,1.53-.76.88-1.8,1.51-2.32,2.62-.23.48-.75.58-1.22.35-.67-.31-.56-.89-.31-1.4.71-1.44,1.94-2.43,3.1-3.46,2.66-2.37,2.68-2.36.36-5.11-.5-.6-1.05-1.16-1.57-1.74-.22-.25-.34-.56-.13-.84.2-.27.56-.24.87-.19,1.09.18,1.71,1.01,2.43,1.72.54.54,1.03,1.57,1.74,1.37.82-.24.4-1.36.48-2.08.18-1.48.32-2.95.89-4.33C8.48.27,8.7.01,9.04,0c.48-.01.69.37.72.75.07.93.1,1.87.07,2.81-.02.68-.26,1.36.17,2.19Z\"></path>\n</svg></a>Metadata</h1>\n<ul>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Author: <a href=\"https://www.amazon.com/Robert-Moor/e/B075T9MRHR/ref=dp_byline_cont_ebooks_1\">Robert Moor</a></p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">ASIN: B0176M3ZG0</p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">ISBN: 1476739218</p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Reference: <a href=\"https://www.amazon.com/dp/B0176M3ZG0\">https://www.amazon.com/dp/B0176M3ZG0</a></p>\n</li>\n<li>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\"><a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0\">Kindle link</a></p>\n</li>\n</ul>\n<h1 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\">\n<svg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 14.81 17.81\" class=\"header-star inline-block mr-2\" width=\"14\" height=\"17\" opacity=\"0.2\">\n  <path d=\"M10.01,5.75c1.18-.82,2.19-1.55,3.22-2.24.48-.32,1.05-.52,1.45.07.39.58-.22.78-.54,1.07-1.15,1.05-2.29,2.12-3.46,3.14-1.61,1.41-1.68,2.82-.12,4.35.44.43.97.78,1.48,1.15.42.3.69.68.51,1.19-.2.58-.69.76-1.28.85-.87.14-1.6-1.14-2.32-.42-.47.48-.41,1.47-.65,2.2-.13.39-.52.6-.91.67-.54.1-.89-.26-1.1-.68-.37-.72-.37-1.45-.11-2.26.29-.91.9-2.19,0-2.72-.56-.33-1.53.82-2.14,1.53-.76.88-1.8,1.51-2.32,2.62-.23.48-.75.58-1.22.35-.67-.31-.56-.89-.31-1.4.71-1.44,1.94-2.43,3.1-3.46,2.66-2.37,2.68-2.36.36-5.11-.5-.6-1.05-1.16-1.57-1.74-.22-.25-.34-.56-.13-.84.2-.27.56-.24.87-.19,1.09.18,1.71,1.01,2.43,1.72.54.54,1.03,1.57,1.74,1.37.82-.24.4-1.36.48-2.08.18-1.48.32-2.95.89-4.33C8.48.27,8.7.01,9.04,0c.48-.01.69.37.72.75.07.93.1,1.87.07,2.81-.02.68-.26,1.36.17,2.19Z\"></path>\n</svg></a>Highlights</h1>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">The footpaths of some ancient indigenous societies, like the Cherokee, were no more than a few inches wide. When Europeans invaded North America, they slowly widened parts of the native trail network, first to accommodate horses, then wagons, then automobiles. Now, much of that network is buried beneath modern roadways, though remnants of the old trail system can still be found when you know where—and how—to look. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=50\">50</a> ^ref-61000</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">There are, it is often said by the more ecumenical prophets, many paths up the mountain. So long as it helps a person navigate the world and seek out what is good, a path, by definition, has value. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=235\">235</a> ^ref-32138</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Here is where the notion of the spiritual path, as portrayed in countless holy books, falters: scriptures tend to present the image of an unchanging route to wisdom, handed down from on high. But paths, like religions, are seldom fixed. They continually change—widen or narrow, schism or merge—depending on how, or whether, their followers elect to use them. Both the religious path and the hiking path are, as Taoists say, made in the walking. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=273\">273</a> ^ref-28826</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Even the dumbest animals are experts at finding the most efficient route across a landscape. Our languages have grown to reflect this fact: In Japan, desire lines are called kemonomichi, or beast trails. In France, they call them chemin de l’âne, or donkey paths. In Holland, they say Olifantenpad, elephant paths. In America and England, people sometimes dub them “cow paths.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=323\">323</a> ^ref-45553</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">In Pilgrim at Tinker Creek, Annie Dillard recounts the horror she felt while reading Fabre’s portrait of these soulless, circling automatons. “It is the fixed that horrifies us,” she wrote. “It is motion without direction, force without power, the aimless procession of caterpillars round the rim of a vase, and I hate it because at any moment I myself might step to that charmed and glistening thread.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=1013\">1013</a> ^ref-4994</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">It was not until the advent of computing that this circle was finally broken; early computers opened up a new path forward. By programming computers to perform insect-like tasks, and by studying the (previously, overwhelmingly complex) behavior of swarms using computers, we began to understand that simple machines following a simple set of rules can ultimately make highly intelligent decisions. They are not either simple or smart; they’re both. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=1227\">1227</a> ^ref-58114</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“I would like to see the emergence of the town,” he said. “If I was the mayor—and the probability of that happening is quite low—my attitude would be very liberal. My objective would be to offer different types of material to help the citizens find the solution that they prefer.” I found this answer somewhat surprising. By all accounts, he was an expert in the design of efficient systems. And yet he would withhold his expertise and allow the town’s residents to plan their own town? “Yes,” he replied, with a look of impish mirth. “To believe that you have the solution for another person is a form of stupidity.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=1285\">1285</a> ^ref-20439</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Yet more striking is Budiansky’s panoramic description of how humans and domesticated animals, having locked themselves into a symbiotic blood pact, proceeded to colonize the earth. What unites humans and our motley alliance of herd animals, he suggested, is that we are all “edge-dwellers,” opportunists who continually exploit new and shifting landscapes. Our flexibility is our chief weapon; we are “the scavenger or grazer that can eat a hundred different foods, not the panda exquisitely adapted to living off nothing but huge quantities of bamboo.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=1713\">1713</a> ^ref-37887</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">When I was younger I used to see the earth as a fundamentally stable and serene place, possessed of a delicate, nearly divine balance, which humans had somehow managed to upset. But as I studied trails more closely, this fantasy gradually evaporated. I now see the earth as the collaborative artwork of trillions of sculptors, large and small. Sheep, humans, elephants, ants: each of us alters the world in our passage. When we build hives or nests, mud huts or concrete towers, we re-sculpt the contours of the planet. When we eat, we convert living matter into waste. And when we walk, we create trails. The question we must ask ourselves is not whether we should shape the earth, but how. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=1991\">1991</a> ^ref-17257</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">For the federal government, the destruction of the buffalo held a certain monstrously efficient logic: it removed one nuisance (cutting down on the pesky buffalo, which ate up valuable grass, muddied ponds, and derailed trains), while weakening another (depriving the Plains Indians of their staple food source and forcing them to end their roaming existence). President Ulysses S. Grant wrote in 1873 that he “would not seriously regret the total disappearance of the buffalo from our western prairies,” as their extinction might increase native people’s “sense of dependence upon the products of the soil and their own labors” (i.e., agriculture and capitalism). — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=2214\">2214</a> ^ref-42893</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Though his research was best known for helping reveal the startling degree to which our road network was inherited (or more accurately, purloined) from Native Americans, Marshall’s top priority was to find those few remaining ancient Cherokee trails that had remained undisturbed. His motivations were (at least, in part) environmentalist: if he could locate a historical Cherokee footpath, federal legislation mandates that the Forest Service must protect a quarter of a mile of land on either side of the trail until it has undergone a proper archaeological survey (which, in certain cases, can take decades). And if the site is ultimately found to be historically significant, then the state can take steps to ensure that the trail’s historical context—which just so happens to be old-growth forest—remains intact. By locating and mapping old Cherokee trails, Marshall had so far been able to protect more than forty-nine thousand acres of public land from logging and mining operations. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=2529\">2529</a> ^ref-47796</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">“You can tell the story without ever going to Mount Mitchell, it’s still an entertaining story. But when you go up on top of that mountain and you see that landform, you’re like ‘Oh, this is what they’re describing.’ It’s amazing.” “Almost every prominent rock and mountain, every deep bend in the river, in the old Cherokee country has its accompanying legend,” noted the ethnographer James Mooney. “It may be a little story that can be told in a paragraph, to account for some natural feature, or it may be one chapter of a myth that has its sequel in a mountain a hundred miles away.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=2774\">2774</a> ^ref-53335</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Standing there, the cruel irony of not just the Trail of Tears, but all Native trails, hit home. Over the course of thousands of years, Native Americans devised a beautifully functional network of paths, not knowing that those same trails would later be used by a foreign empire in its slow invasion. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=2860\">2860</a> ^ref-43873</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">People fighting to preserve indigenous cultures tend to fall into one of two camps. Some believe that technology (being malleable and agnostic) will continue to evolve to better perpetuate elements of indigenous culture, like the Cherokee keyboard, and to situate traditional knowledge in the landscape (using digital maps). Others, like Jackson, counter that without time spent learning directly from the land, no amount of technology would halt the cultural erosion. Somewhat ironically, given his general aversion to technology, Lamar Marshall had ultimately been converted by the techno-evangelists. In response to the loss of land-based learning, he has begun importing over a thousand miles of trails into digital maps—along with the stories, wild foods, and medicine to be found along those trails—so they could one day be accessed by future generations of Cherokees. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=3039\">3039</a> ^ref-64993</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Marshall’s program was a small but meaningful attempt to resituate the story in its rightful place. However, it still lacked the immediacy of terra firma. Marshall knew this, so he hoped to one day build an application that incorporated augmented reality technology with stories and maps, so that children could stand on the slopes of Rattlesnake Mountain while watching the tale of the Uktena unfold through virtual-reality goggles, or visit the sacred Kituwah mound and see a digital rendering of the site as it once was, four centuries earlier, aglow with the light of the sacred fire. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=3068\">3068</a> ^ref-52715</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">They recognized the land’s bounty and grandeur, but they largely ignored the work the indigenous people had put into making it that way; having come from a place where most of the large trees had been razed, they wondered at the towering forests, without realizing they were coaxed upward by Native hands; they exulted at the profusion of wild deer without realizing that they were the result of tactical brush fires and careful hunting. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=3268\">3268</a> ^ref-64100</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">How, one must wonder, had a human being—indeed, a whole generation of human beings—become so abstracted from the land (the solid earth! the actual world!) as to warrant such an epiphany? The answer, as we’ve seen, stretches back through our ancestral past: through agriculture, which obviated the hunter-gatherer’s need to walk, study, and interact with whole ecosystems; through writing, which replaced the landscape as an archive of communal knowledge; through monotheism, which vanquished the animist spirits and erased their earthly shrines; through urbanization, which concentrated people in built environments; and through a snug pairing of mechanical technology and animal husbandry, which allowed people to travel over the earth at blurring speeds. Euro-Americans had been working for millennia to forget what an unpeopled planet looked like. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=3415\">3415</a> ^ref-24701</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">As the anthropologist Tim Ingold has pointed out, instead of being immersed in an endless continuum of landscapes, we increasingly experience the world as a network of “nodes and connectors”: homes and highways, airports and flight routes, websites and links. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=3932\">3932</a> ^ref-5248</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">However, a desk full of a million tiny books would not on its own solve the problem of information overload; if anything, it would exacerbate it. To remedy this problem, Bush envisioned that the texts could be strung together into “associative trails.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=4262\">4262</a> ^ref-31137</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">However, as the first successful web browsers, like Mosaic, began rolling out, Berners-Lee found, to his dismay, that they were composed of fixed columns of text surrounded by dazzling images, more like a magazine spread than a chalkboard—and, thus, more like a highway than a trail. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=4300\">4300</a> ^ref-35024</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">WE MOVE through this world on paths laid down long before we are born. From our first breath, there is a vast array of structures already in place—“spiritual paths,” “career paths,” “philosophical paths,” “artistic paths,” “paths to wellness,” “paths to virtue”—which — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=4605\">4605</a> ^ref-47819</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">For children of the Land of Opportunity—beset on all sides by what the psychologist Barry Schwartz has called “the paradox of choice”—the newfound freedom from choices comes as an enormous relief. This form of freedom is a curious thing, at once an expansion and a constriction of one’s options. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=4863\">4863</a> ^ref-52071</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">The problem, he said, was that hikers tended to divide their lives into compartments: wilderness over here, civilization over there. “The walls that exist between each of these compartments are not there naturally,” he said. “We create them. The guy that has to stand there and look at Mount Olympus to find peace and quiet and solitude and meaning—life has escaped him totally! Because it’s down there in Seattle, too, on a damn downtown street. I’ve tried to break those walls down and de-compartmentalize my life so that I can find just as much peace and joy in that damned homebound rush-hour traffic that we were walking through yesterday.” — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=4882\">4882</a> ^ref-32159</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Shaving down one’s pack weight, he said, was a process of sloughing off one’s fears. Each object a person carries represents a particular fear: of injury, of discomfort, of boredom, of attack. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=5068\">5068</a> ^ref-11980</p>\n<hr>\n<p class=\"max-w-prose\" style=\"max-width: 50ch;\">Old age brings with it another kind of liberation: freedom from the doubt, angst, and restlessness of youth. The old can look back and see their decisions as a single concatenation, sheared of all the ghostly, untaken routes. — location: <a href=\"kindle://book?action=open&#x26;asin=B0176M3ZG0&#x26;location=5130\">5130</a> ^ref-14343</p>\n<hr>"
}