{
  "frontmatter": {
    "kindle-sync": {
      "bookId": "34315",
      "title": "Other People: Takes & Mistakes",
      "author": "David Shields",
      "asin": "B01G0GD0WC",
      "lastAnnotatedDate": "2020-12-23",
      "bookImageUrl": "https://m.media-amazon.com/images/I/91s3oyefvYL._SY160.jpg",
      "highlightsCount": 4
    },
    "date": "2022-12-14T20:26:44.000Z",
    "modified": "2022-12-23T15:54:10.000Z",
    "tags": [
      "writing",
      "journalism",
      "photography",
      "health"
    ],
    "hidden": false,
    "draft": false
  },
  "content": "# Other People\n\n#writing #journalism \n\n# Metadata\n\n* Author: [David Shields](https://www.amazon.com/David-Shields/e/B000APH64S/ref=dp_byline_cont_ebooks_1)\n\n* ASIN: B01G0GD0WC\n\n* ISBN: 0385351992\n\n* Reference: <https://www.amazon.com/dp/B01G0GD0WC>\n\n* [Kindle link](kindle://book?action=open&asin=B01G0GD0WC)\n\n# Highlights\n\nIn so many photographs of Pepi or my father or me is a certain quality of mugging hungrily, of pretty-boyness (me till I was twelve, my father deep into middle age—“Your dad is a really distinguished-looking man!”—Schildkraut until he was dead), of stilted posedness, of on-your-knees-before-the-camera obsequiousness, of needing to be liked by the lens, of peasant smilingness, of overreliance upon previous modes of appearing in pictures…. — location: [374](kindle://book?action=open&asin=B01G0GD0WC&location=374) ^ref-21582\n\n---\n\nI thought I was sneezing because I’d finally developed an allergy to Rachel, whereas Rachel, who’d learned all about psychosomatic disorders when she was in analysis, assumed I was sneezing because I’d developed an allergy to my family, whereas it turned out I’d developed an allergy to the dust I’d encountered the night before, searching for my suitcase in the basement. — location: [1748](kindle://book?action=open&asin=B01G0GD0WC&location=1748) ^ref-13340\n\n---\n\nHer goal seemed to be to burn images of herself into my retina forever. Mission accomplished: I could never tell how much genuine feeling there was in her brilliant performance, and yet I still have quite specific sense-memories of these events, which occurred more than thirty years ago. Humankind cannot bear very much reality. — location: [1788](kindle://book?action=open&asin=B01G0GD0WC&location=1788) ^ref-61520\n\n---\n\nThe arrogance implied in believing that one’s beauty can afford to be concealed is entrancing. By contrast, people not wearing glasses sometimes seem preposterously accessible, uncomplicated, unmysterious, trampy. — location: [1964](kindle://book?action=open&asin=B01G0GD0WC&location=1964) ^ref-1524\n\n---\n"
}