{
  "html": "<h2 class=\"\" id=\"i-just-do-what-my-calendar-tells-me-to-do\">I Just Do What My Calendar Tells Me to Do</h2>\n<p class=\"\">My friends don't understand why, when we make casual plans to grab dinner or see a movie, I immediately send them a calendar invite. They think it's overkill for something spontaneous and social. But here's the thing: I really do just follow what my calendar says, as much as possible, and it's become a core part of my personality that helps me manage my ADHD tendencies and carve out focused time for deep work.</p>\n<h3 class=\"\" id=\"the-calendar-as-external-brain\">The Calendar as External Brain</h3>\n<p class=\"\">The title of this piece isn't hyperbole. At any given moment, if you ask me what I should be doing, I'll look at my calendar and that's what I'll do. This isn't about being rigid or antisocial—it's about offloading decision-making to past-me so present-me can focus on execution instead of constant micro-decisions about what to do next.</p>\n<p class=\"\">Without this system, my ADHD brain will ping-pong between tasks, check social media \"for just a second,\" or spend twenty minutes deciding whether to work on project A or project B. With everything scheduled, those decisions are already made. The calendar becomes my external brain, holding not just appointments but intentions.</p>\n<h3 class=\"\" id=\"why-casual-plans-get-calendar-invites\">Why Casual Plans Get Calendar Invites</h3>\n<p class=\"\">When friends suggest grabbing drinks \"sometime next week,\" my immediate response is to find a specific time and send an invite. This drives some people crazy, but here's why it matters:</p>\n<p class=\"\"><strong class=\"\">Casual plans without calendar invites usually don't happen.</strong> Someone forgets, someone double-books, someone assumes the other person will reach out first. The calendar invite transforms a vague intention into a commitment.</p>\n<p class=\"\"><strong class=\"\">It lets me prepare mentally.</strong> If I know I'm having dinner with friends Tuesday at 7 PM, I can plan my work day around that transition. I can wrap up focused work by 6, shower, and show up present instead of distracted by whatever task I was just abandoning.</p>\n<p class=\"\"><strong class=\"\">It protects both our time.</strong> That calendar block prevents me from accidentally scheduling something else, and it gives my friends a clear expectation about my availability.</p>\n<p class=\"\"><img src=\"IMG_8205.jpeg\" alt=\"\" class=\"w-full mx-auto py-4\"></p>\n<h3 class=\"\" id=\"the-system-everything-gets-scheduled\">The System: Everything Gets Scheduled</h3>\n<p class=\"\">When I have a task that needs to be done, I immediately make time for it on my calendar. Not just meetings and appointments, but focused work blocks, email processing time, even \"think about project X\" sessions. If it matters enough to do, it matters enough to schedule.</p>\n<h4 class=\"\" id=\"always-visible-next-event\">Always Visible Next Event</h4>\n<p class=\"\">I use Google Calendar as the source of truth, plus Fantastical on my MacBook for quick daily views. On my Apple Watch, my next meeting is always visible. Every computer I use has a menu bar widget showing upcoming events. This creates constant gentle awareness of what's next without having to actively check.</p>\n<h4 class=\"\" id=\"automated-buffer-time\">Automated Buffer Time</h4>\n<p class=\"\">I use Calendly for external meetings and Reclaim AI to automatically block focus time and create buffers between calls. This ensures I have transition time to wrap up one thing and mentally prepare for the next, rather than ping-ponging between contexts all day.</p>\n<h3 class=\"\" id=\"the-psychology-of-pre-commitment\">The Psychology of Pre-Commitment</h3>\n<p class=\"\">There's something powerful about trusting past-me to make good decisions about future-me's time. When I'm scheduling something for next Tuesday, I'm usually thinking more clearly than when Tuesday arrives and I'm dealing with whatever fires have sprung up.</p>\n<p class=\"\">The calendar becomes a contract with myself. Present-me might not feel like writing or might want to scroll Twitter instead of preparing for that meeting, but past-me already decided this was important. Following the calendar removes the need to re-litigate those decisions every few hours.</p>\n<h3 class=\"\" id=\"when-the-system-breaks-down\">When the System Breaks Down</h3>\n<p class=\"\">This approach isn't perfect. Sometimes urgent things come up that require reshuffling the schedule. Sometimes I underestimate how long something will take or overestimate my energy levels. But the key insight is that having a system that works 80% of the time is infinitely better than having no system and spending mental energy on scheduling decisions all day.</p>\n<p class=\"\">The calendar also can't handle everything—it doesn't know when I'll be in a creative flow state versus when I'll need to do administrative busywork. But it creates the framework that makes those moments of deep work possible.</p>\n<h3 class=\"\" id=\"looking-backward-for-motivation\">Looking Backward for Motivation</h3>\n<p class=\"\">One unexpected benefit: my calendar becomes a record of how I actually spent my time. Looking back at completed weeks shows concrete evidence of progress that my ADHD brain often fails to register in the moment. \"I feel like I didn't get anything done this week\" becomes \"Actually, I wrote for six hours, had three important meetings, and finished that project I've been procrastinating on.\"</p>\n<h3 class=\"\" id=\"the-relief-of-not-deciding\">The Relief of Not Deciding</h3>\n<p class=\"\">The biggest gift this system gives me is the relief of not having to decide what to do next. Decision fatigue is real, and every moment spent wondering \"Should I work on this or that?\" is energy not spent on actually doing the work.</p>\n<p class=\"\">My friends might think the calendar invites for casual plans are excessive, but they work. The dinner happens, we both show up prepared and present, and nobody has to play the \"when works for you?\" text tennis game.</p>\n<p class=\"\">I just do what my calendar tells me to do. It's simple, it works, and it frees up mental energy for the things that actually require creativity and focus.</p>",
  "title": "I Just Do What My Calendar Says",
  "metadata": {
    "draft": false,
    "dek": "In which I explain why I send calendar invites for casual hangouts and how surrendering to my calendar helps manage ADHD and creates space for deep work",
    "inprogress": false,
    "date": "2023-01-06T22:34:06.000Z",
    "modified": "2025-08-29T21:06:48.000Z",
    "tags": ["automation", "adhd", "productivity", "systems"],
    "hidden": false,
    "words": 881,
    "images": 1,
    "imageDetails": {
      "total": 1,
      "cloudinary": 0,
      "withDimensions": 0
    },
    "links": 1,
    "codeBlocks": 0,
    "headers": {},
    "toc": [],
    "type": "post",
    "sourcePath": "../../../../../code/website2/content/blog/drafts/_stale/i-just-do-what-my-calendar-says.md",
    "sourceDir": "/Users/ejfox/Library/Mobile Documents/iCloud~md~obsidian/Documents/ejfox/"
  }
}
