{
  "content": "<p class=\"mb-4\">#programming #personal #process</p>\n<p class=\"mb-4\"><img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png\" alt=\"\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png 400w, https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png 800w, https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full mx-auto py-4\" crossorigin=\"anonymous\" style=\"display: block; max-width: 100%;\"></p>\n<p class=\"mb-4\">From personal projects to collaborations, paid work to passion projects, lets explore how I write code to achieve specific goals. We'll discuss the importance of clear goals, user stories, acceptance criteria, deadlines, and our core guiding principles.</p>\n<p class=\"mb-4\">The rough shape of the project changes depending on a few factors:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\">Personal project vs group project</li>\n<li class=\"\">Paid vs unpaid</li>\n<li class=\"\">Fast vs slow</li>\n<li class=\"\">Public vs private</li>\n</ul>\n<p class=\"mb-4\">For more less-technical specifics around project management in general (not just code): <a href=\"how-to-run-a-projec\" class=\"text-blue-600 dark:text-blue-400\">how-to-run-a-projec</a>t]]</p>\n<p class=\"mb-4\">For design philosophy <a href=\"blog/2023/design-philosoph\" class=\"text-blue-600 dark:text-blue-400\">blog/2023/design-philosoph</a>y]] and work philosophy <a href=\"blog/2022/joy-driven-developmen\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/joy-driven-developmen</a>t]]</p>\n<p class=\"mb-4\">The tools I use to prototype quickly: <a href=\"blog/2022/2022-prototyping-toolki\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/2022-prototyping-toolki</a>t]]</p>\n<p class=\"mb-4\">My coding setup, including theme and plugins: <a href=\"blog/2022/my-vscode-setu\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/my-vscode-setu</a>p]]</p>\n<h2 class=\"text-3xl font-semibold mb-4 mt-8\" id=\"establish-a-clear-goal\">Establish a clear goal</h2>\n<p class=\"mb-4\">Sometimes the goal of a project can boil down to <strong class=\"\">\"who are we trying to make happy?\"</strong></p>\n<p class=\"mb-4\">That could be a particular type of user, or it could be a powerful stakeholder, or the person who commissioned the project. Who controls the future of this project and what are they trying to get out of it? How can we make them happy?</p>\n<p class=\"mb-4\">On personal project the goals might not be so clear, and it's worth digging into why something is interesting and putting it into words. Treat yourself as your client, with all the patience and diligence that implies. Write yourself a clear and comprehensive brief that you can come back to later.</p>\n<p class=\"mb-4\">Personal projects can be beneficial for a variety of reasons:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\">Explore personal curiosities</li>\n<li class=\"\">Learn new technologies / techniques</li>\n<li class=\"\">Collaborate with cool people</li>\n<li class=\"\">Create material for self-promotion</li>\n<li class=\"\">Create work that you want to do more of</li>\n</ul>\n<p class=\"mb-4\">You can usually only accomplish a few of those goals, and knowing the bounds of your motivation for a project can help you avoid diving deep into the wrong areas and getting burnt out.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"user-stories\">User stories</h3>\n<p class=\"mb-4\">User stories are essential to writing software that will be used by people. I talk more about user stories in <a href=\"how-to-run-a-projec\" class=\"text-blue-600 dark:text-blue-400\">how-to-run-a-projec</a>t]]</p>\n<h4 class=\"\" id=\"tldr\">tl;dr</h4>\n<blockquote class=\"pl-4 border-l-4 border-zinc-300 dark:border-zinc-700 my-4\">\n<p class=\"text-zinc-600 dark:text-zinc-400 mb-4\">User stories are a way of describing the functionality of a system from the perspective of the user. User stories are written in the following format:\n\"As a *type of user, I want <em class=\"\">goal</em> so that <em class=\"\">reason</em>.\"</p>\n</blockquote>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"acceptance-criteria\">Acceptance criteria</h3>\n<p class=\"mb-4\">Acceptance criteria are predefined rules that determine whether a given feature or piece of functionality is working as intended. They are a set of statements, with a clear pass or fail result, that specify both functional and nonfunctional requirements, and are used to assess the success of a project. These conditions must be met to consider a project successful.</p>\n<p class=\"mb-4\">Acceptance criteria help to create a shared understanding between team members, clients, and stakeholders about what is expected from an engagement. It's important that they are clear, specific, measurable, and easy to validate.</p>\n<p class=\"mb-4\">I often write my acceptance criteria in the form of user stories.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"deadline\">Deadline</h3>\n<p class=\"mb-4\">Deadlines, while sometimes stressful, actually serve an important role in managing your work. They help to frame the timeline and encourage focus and productivity. A clearly defined deadline sets the expectation for when work should be completed and ensures that everyone is working towards the same goal.</p>\n<h4 class=\"\" id=\"do-not-break-deadlines\">Do not break deadlines</h4>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"core-principles\">Core principles</h3>\n<p class=\"mb-4\"><a href=\"blog/2022/joy-driven-developmen\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/joy-driven-developmen</a>t]]</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"gather-context\">Gather context</h3>\n<h4 class=\"\" id=\"stakeholder-needs\">Stakeholder Needs</h4>\n<p class=\"mb-4\">Knowing who the stakeholders are and what they expect from the project is crucial. Needs could range from project timeline, budget, technical specifics, to the business impact.</p>\n<h4 class=\"\" id=\"project-goals\">Project Goals</h4>\n<p class=\"mb-4\">Understanding and articulating the main objectives behind the project, along with what problem the project aims to solve.</p>\n<h4 class=\"\" id=\"technical-infrastructure\">Technical Infrastructure</h4>\n<p class=\"mb-4\">Understanding the tools, platforms, or systems that will be used during the project helps in planning and implementation.</p>\n<h4 class=\"\" id=\"user-expectations\">User Expectations</h4>\n<p class=\"mb-4\">If the project involves a user base, understanding their expectations and needs can significantly enhance the project's design and usability.</p>\n<h4 class=\"\" id=\"market-trends\">Market Trends</h4>\n<p class=\"mb-4\">Keeping abreast of existing market trends, both direct and indirect competition, can inform the strategy and positioning of your project.</p>\n<h4 class=\"\" id=\"prior-work\">Prior work</h4>\n<p class=\"mb-4\">Before starting a new project, it's beneficial to research and understand the work that has already been done in the area. Existing solutions, projects, or research might provide valuable insights, lessons learned, or even spark new ideas. Evaluating prior work can also prevent you from duplicating efforts or repeating the same mistakes.</p>\n<h4 class=\"\" id=\"terminology--names\">Terminology / names</h4>\n<p class=\"mb-4\">Every industry or project often has its own set of unique terms, names, or jargon. Familiarizing yourself with these terms can hugely impact your understanding of the project and improve your communication with stakeholders and team members. Trying to speak the same language as your users or clients can foster better understanding, and convey professionalism and competence.</p>\n<p class=\"mb-4\">When creating new things, often new names need to be invented. I try not to be too precious about this process. The key is to just pick a sensible name for a thing and stick to it, until a better taxonomy develops and it makes sense to rename it. It is often very difficult to rename things once the name has been embedded deeply into the code. Only the bravest developers rename existing variables, especially deeply-entrenched ones.</p>\n<h4 class=\"\" id=\"carefully-pick-your-tools\">Carefully pick your tools</h4>\n<p class=\"mb-4\">Not every project will require the same set of tools. Depending on the project's nature, the 'right' tools can hugely differ. It's important to identify and understand the tools available that could aid your project's development, whether they're software for task management, design tools, coding platforms, analytical tools, or even physical equipment if relevant. They can save time, increase efficiency, and provide new capabilities.</p>\n<p class=\"mb-4\">Often the most productive developers aren't the ones with the most experience or domain expertise, but those with the best set of tools for a particular problem.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"gather-data-and-explore\">Gather data and explore</h3>\n<p class=\"mb-4\">Data forms the backbone of any data visualization project. The type and amount of data needed will depend on the project's complexity and scope. Gathering useful data is a systematic process involving identifying data sources, collecting information, cleaning it, and then verifying its accuracy and relevance.</p>\n<p class=\"mb-4\">In the exploration phase, objective analysis of the gathered data can reveal patterns, trends, and insights that inform your project direction and strategy.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"metadata-whats-there-whats-missing\">Metadata: what’s there? What’s missing?</h3>\n<p class=\"mb-4\">As we navigate the development process, one crucial step is managing metadata - the information about our data. It's key in understanding the depth and quality of assembled data and integral to interpreting it correctly.</p>\n<p class=\"mb-4\">Observing what data exists and recognizing what's missing allows us to validate our data's completeness and reliability. Like a pre-flight checklist for a pilot, knowing your metadata and any gaps that exist helps you anticipate and mitigate any potential hiccups when using the data to drive your project decisions. It ensures the journey ahead relies on dependable, comprehensible information.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"go-wide-establish-possibilities\">Go Wide, Establish Possibilities</h3>\n<p class=\"mb-4\">In this stage of the process, the objective is to broaden the horizons of your project and explore as many possibilities as you can. This is the brainstorming phase where no idea is dismissed prematurely. Encourage out-of-the-box thinking and don't limit your exploration to just the tried-and-true.</p>\n<p class=\"mb-4\">This step might involve several techniques like:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\"><strong class=\"\">Mind Mapping:</strong> This visual tool can help you organize thoughts, ideas, and potential solutions related to your project.</li>\n<li class=\"\"><strong class=\"\">Prototyping:</strong> Quick hands-on experiments or simulations can provide insights on feasibility of ideas.</li>\n<li class=\"\"><strong class=\"\">Notebooks:</strong> Jotting down or sketching ideas can help retain them and facilitate deeper analysis later.</li>\n<li class=\"\"><strong class=\"\">Clients feedback and iteration loops:</strong> Engaging stakeholders at this stage can bring in fresh perspectives and align ideas better to actual needs.</li>\n</ul>\n<p class=\"mb-4\">By stretching the possibilities wide in this stage, you ensure you have multiple approaches or solutions to choose</p>\n<h4 class=\"\" id=\"visual-forms-for-data\">Visual Forms for data</h4>\n<p class=\"mb-4\">The use of visual forms in the exploration stage is instrumental. They convert raw data into insightful visuals, leading to an enhanced understanding and drastically improving the quality of the project:</p>\n<h5 class=\"\" id=\"numeric-values-scatterplot\">Numeric Values: Scatterplot</h5>\n<p class=\"mb-4\">Scatterplots illuminate trends or outliers in numeric data, providing a clear path to impactful solutions.</p>\n<h5 class=\"\" id=\"geographic-data-map\">Geographic Data: Map</h5>\n<p class=\"mb-4\">Maps transform location-based data into discernible patterns, opening up the landscape for strategic decisions.</p>\n<h5 class=\"\" id=\"data-with-time-line-chart-or-animation\">Data with Time: Line Chart or Animation</h5>\n<p class=\"mb-4\">Line charts or animations translate progression over time into visible trends, illuminating the path forward.</p>\n<h5 class=\"\" id=\"everything-tables\">Everything: Tables</h5>\n<p class=\"mb-4\">Our goal is not to visualize data just to make our work beautiful– sometimes the clearest way to convey some information is a simple humble table.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"make-a-prototype\">Make a prototype</h3>\n<p class=\"mb-4\">In the developmental journey, crafting a prototype is your first step towards making your project tangible. A prototype, often developed with Vue/Nuxt in my process, is a functional, interactive model that embodies your design vision.</p>\n<p class=\"mb-4\">A prototype primarily serves as a validation tool - a way to test design hypotheses, functionality, and gather initial user feedback. Prototypes might not encompass the full functionality of the final product and often focus on testing specific aspects of the design. As such, they're meant to be iterative, changed, and refined based on user feedback and testing outcomes.</p>\n<p class=\"mb-4\">An important distinction to make is between a prototype and a Minimum Viable Product (MVP). While they seem similar, their purpose and scope differ. An MVP is a pared-down version of your product that includes just the core features necessary to make it work and deliver value to users. It's more polished than a prototype and is generally used to see how the target audience responds to the product's main idea. While the prototype is more for internal validation of design ideas, an MVP is put in front of actual users.</p>\n<h4 class=\"\" id=\"designing-an-mvp\">Designing an MVP</h4>\n<p class=\"mb-4\">When designing a Minimum Viable Product (MVP), the goal is to develop a product with the smallest possible feature set that still delivers core value to the user. To achieve this, everything we've done so far comes into play.</p>\n<p class=\"mb-4\">The understanding gained from gathering context about user needs, project goals, and stakeholder requirements informs what your MVP must achieve. The data exploration and visual forms help you grasp the intricacies of the data your MVP will handle, influencing design decisions.</p>\n<p class=\"mb-4\">Starting with a mobile-first design helps focus on what's essential. On smaller screens, every element matters and unnecessary complexity can ruin user experience. This approach forces you to prioritize features, displaying only what's crucial on your MVP.</p>\n<p class=\"mb-4\">Using tools like Figma, create interactive high-fidelity prototypes to visualize the flow and feel of your MVP. Use it to try out different design possibilities and interaction patterns before committing any code.</p>\n<p class=\"mb-4\">It's important here to think in terms of problem-solving, not feature-building. Keep asking: what is the simplest solution that solves the problem for our users?</p>\n<p class=\"mb-4\">When defining the scope of your MVP, consider data prototypes too, especially for products involving complex data interactions. They allow you to test feasibility and performance early on.</p>\n<p class=\"mb-4\">At this stage, a key mantra should be: don't fall in love with your ideas. Be open to discard features or elements if they do not serve the primary goal of your MVP.</p>\n<p class=\"mb-4\">Ultimately, designing an MVP is about discerning what's absolutely necessary for your product to provide its core value, and having the discipline to say 'no' to everything else until after validating the MVP. It is a challenging process but essential in creating focused, valuable products while minimizing wasted efforts.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"visual-design-and-polish\">Visual design and polish</h3>\n<p class=\"mb-4\">Post-MVP, attention turns to enhancing user experience with aesthetics. It's more than just colors and fonts; it's about intuitive, consistent visuals that boost user engagement.</p>\n<p class=\"mb-4\">Visual design gives your product its aesthetic appeal, aligning it with the brand's identity and improving user experience. It includes aspects like color schemes, typography, iconography, layout and spacing, among others.</p>\n<p class=\"mb-4\">Polishing your product involves refining every element and interaction to make sure it's smooth, intuitive, and visually pleasing. It's about paying attention to small details like consistency in design elements, easy-to-read fonts, sensible animations, effective color contrasts, and so on.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"user-testing\">User Testing</h3>\n<p class=\"mb-4\">User testing is the pivotal phase where your product, the MVP you designed and polished, is put to the test in the hands of actual users. It provides crucial insights into its usability and any potential areas for improvement.</p>\n<h4 class=\"\" id=\"the-user-is-always-right\">The User is Always Right</h4>\n<p class=\"mb-4\">During user testing, one mantra to remember is: The user is always right. If users struggle with a certain feature or can't navigate through your app intuitively, it indicates that changes are needed. This feedback is invaluable in improving the product and enhancing user satisfaction. After all, a product that doesn't meet user needs or isn't user-friendly will struggle to find success.</p>\n<h4 class=\"\" id=\"be-open-to-big-pivots\">Be Open to Big Pivots</h4>\n<p class=\"mb-4\">It's also essential to remain open-minded and ready for change during this stage. Sometimes, user testing might reveal that significant changes (or pivots) are necessary for your product to work effectively. These pivots could range from minor feature tweaks to a complete overhaul of certain aspects. Being flexible and open to these big pivots can significantly improve your product's final version.</p>\n<h4 class=\"\" id=\"beginners-mind-is-invaluable\">Beginners Mind is Invaluable</h4>\n<p class=\"mb-4\">Approaching user testing with a 'beginner's mind' can be invaluable. This mindset allows you to observe and understand users' experiences without preconceived notions, helping identify pain points or difficulties a more experienced eye might overlook.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"documenting-the-process\">Documenting the Process</h3>\n<p class=\"mb-4\">The process of developing a project is a journey filled with valuable insights, decisions, and iterations. Documenting this process serves several purposes:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\">It provides a historical record of your project, allowing you to trace back your steps, understand the decisions made, and learn from them.</li>\n<li class=\"\">It facilitates communication and transparency with stakeholders, clients or team members. They can see the progress made, understand the reasoning behind decisions, and contribute more effectively.</li>\n<li class=\"\">It's a great tool for reflection and learning. Looking back at your documentation can provide insights into your working style, efficiency, and areas for improvement.</li>\n</ul>\n<p class=\"mb-4\">There are several ways to document the process effectively:</p>\n<h4 class=\"\" id=\"screenshots\">Screenshots</h4>\n<p class=\"mb-4\">Visuals can communicate information quickly and intuitively. Regularly taking screenshots of your work - be it design drafts, code snippets, bug reports or user feedback - can create a rich visual timeline of your project.</p>\n<h4 class=\"\" id=\"working-in-public\">Working in Public</h4>\n<p class=\"mb-4\">Sharing your work progress publicly (e.g., on social media or a blog) not only serves as documentation but also invites feedback and creates accountability. It can foster community engagement and even attract potential users or clients.</p>\n<h4 class=\"\" id=\"working-in-semi-public\">Working in semi-Public</h4>\n<p class=\"mb-4\">Even if you aren't sharing your work publicly, you can \"liveblog\" your progress in your company's shared chat channels.</p>\n<h4 class=\"\" id=\"live-streaming\">Live-Streaming</h4>\n<p class=\"mb-4\">Live-streaming your work sessions is another form of real-time documentation. It gives people an inside look into your workflow and decision-making process. This transparency can build trust with clients or users and facilitate learning for others in your field.</p>",
  "html": "<p class=\"mb-4\">#programming #personal #process</p>\n<p class=\"mb-4\"><img src=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png\" alt=\"\" srcset=\"https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_400/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png 400w, https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_800/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png 800w, https://res.cloudinary.com/ejf/image/upload/c_scale,f_auto,q_auto:good,w_1200/v1679587770/610144184_A_curious_man_in_a_flatbrim_baseball_cap_and_a_short_cropped_brown_beard__flying_over_a_sea_of_blog_.png 1200w\" sizes=\"(min-width: 768px) 80vw, 100vw\" loading=\"lazy\" decoding=\"async\" class=\"w-full max-w-full mx-auto w-full mx-auto py-4\" crossorigin=\"anonymous\" style=\"display: block; max-width: 100%;\"></p>\n<p class=\"mb-4\">From personal projects to collaborations, paid work to passion projects, lets explore how I write code to achieve specific goals. We'll discuss the importance of clear goals, user stories, acceptance criteria, deadlines, and our core guiding principles.</p>\n<p class=\"mb-4\">The rough shape of the project changes depending on a few factors:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\">Personal project vs group project</li>\n<li class=\"\">Paid vs unpaid</li>\n<li class=\"\">Fast vs slow</li>\n<li class=\"\">Public vs private</li>\n</ul>\n<p class=\"mb-4\">For more less-technical specifics around project management in general (not just code): <a href=\"how-to-run-a-projec\" class=\"text-blue-600 dark:text-blue-400\">how-to-run-a-projec</a>t]]</p>\n<p class=\"mb-4\">For design philosophy <a href=\"blog/2023/design-philosoph\" class=\"text-blue-600 dark:text-blue-400\">blog/2023/design-philosoph</a>y]] and work philosophy <a href=\"blog/2022/joy-driven-developmen\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/joy-driven-developmen</a>t]]</p>\n<p class=\"mb-4\">The tools I use to prototype quickly: <a href=\"blog/2022/2022-prototyping-toolki\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/2022-prototyping-toolki</a>t]]</p>\n<p class=\"mb-4\">My coding setup, including theme and plugins: <a href=\"blog/2022/my-vscode-setu\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/my-vscode-setu</a>p]]</p>\n<h2 class=\"text-3xl font-semibold mb-4 mt-8\" id=\"establish-a-clear-goal\">Establish a clear goal</h2>\n<p class=\"mb-4\">Sometimes the goal of a project can boil down to <strong class=\"\">\"who are we trying to make happy?\"</strong></p>\n<p class=\"mb-4\">That could be a particular type of user, or it could be a powerful stakeholder, or the person who commissioned the project. Who controls the future of this project and what are they trying to get out of it? How can we make them happy?</p>\n<p class=\"mb-4\">On personal project the goals might not be so clear, and it's worth digging into why something is interesting and putting it into words. Treat yourself as your client, with all the patience and diligence that implies. Write yourself a clear and comprehensive brief that you can come back to later.</p>\n<p class=\"mb-4\">Personal projects can be beneficial for a variety of reasons:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\">Explore personal curiosities</li>\n<li class=\"\">Learn new technologies / techniques</li>\n<li class=\"\">Collaborate with cool people</li>\n<li class=\"\">Create material for self-promotion</li>\n<li class=\"\">Create work that you want to do more of</li>\n</ul>\n<p class=\"mb-4\">You can usually only accomplish a few of those goals, and knowing the bounds of your motivation for a project can help you avoid diving deep into the wrong areas and getting burnt out.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"user-stories\">User stories</h3>\n<p class=\"mb-4\">User stories are essential to writing software that will be used by people. I talk more about user stories in <a href=\"how-to-run-a-projec\" class=\"text-blue-600 dark:text-blue-400\">how-to-run-a-projec</a>t]]</p>\n<h4 class=\"\" id=\"tldr\">tl;dr</h4>\n<blockquote class=\"pl-4 border-l-4 border-zinc-300 dark:border-zinc-700 my-4\">\n<p class=\"text-zinc-600 dark:text-zinc-400 mb-4\">User stories are a way of describing the functionality of a system from the perspective of the user. User stories are written in the following format:\n\"As a *type of user, I want <em class=\"\">goal</em> so that <em class=\"\">reason</em>.\"</p>\n</blockquote>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"acceptance-criteria\">Acceptance criteria</h3>\n<p class=\"mb-4\">Acceptance criteria are predefined rules that determine whether a given feature or piece of functionality is working as intended. They are a set of statements, with a clear pass or fail result, that specify both functional and nonfunctional requirements, and are used to assess the success of a project. These conditions must be met to consider a project successful.</p>\n<p class=\"mb-4\">Acceptance criteria help to create a shared understanding between team members, clients, and stakeholders about what is expected from an engagement. It's important that they are clear, specific, measurable, and easy to validate.</p>\n<p class=\"mb-4\">I often write my acceptance criteria in the form of user stories.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"deadline\">Deadline</h3>\n<p class=\"mb-4\">Deadlines, while sometimes stressful, actually serve an important role in managing your work. They help to frame the timeline and encourage focus and productivity. A clearly defined deadline sets the expectation for when work should be completed and ensures that everyone is working towards the same goal.</p>\n<h4 class=\"\" id=\"do-not-break-deadlines\">Do not break deadlines</h4>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"core-principles\">Core principles</h3>\n<p class=\"mb-4\"><a href=\"blog/2022/joy-driven-developmen\" class=\"text-blue-600 dark:text-blue-400\">blog/2022/joy-driven-developmen</a>t]]</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"gather-context\">Gather context</h3>\n<h4 class=\"\" id=\"stakeholder-needs\">Stakeholder Needs</h4>\n<p class=\"mb-4\">Knowing who the stakeholders are and what they expect from the project is crucial. Needs could range from project timeline, budget, technical specifics, to the business impact.</p>\n<h4 class=\"\" id=\"project-goals\">Project Goals</h4>\n<p class=\"mb-4\">Understanding and articulating the main objectives behind the project, along with what problem the project aims to solve.</p>\n<h4 class=\"\" id=\"technical-infrastructure\">Technical Infrastructure</h4>\n<p class=\"mb-4\">Understanding the tools, platforms, or systems that will be used during the project helps in planning and implementation.</p>\n<h4 class=\"\" id=\"user-expectations\">User Expectations</h4>\n<p class=\"mb-4\">If the project involves a user base, understanding their expectations and needs can significantly enhance the project's design and usability.</p>\n<h4 class=\"\" id=\"market-trends\">Market Trends</h4>\n<p class=\"mb-4\">Keeping abreast of existing market trends, both direct and indirect competition, can inform the strategy and positioning of your project.</p>\n<h4 class=\"\" id=\"prior-work\">Prior work</h4>\n<p class=\"mb-4\">Before starting a new project, it's beneficial to research and understand the work that has already been done in the area. Existing solutions, projects, or research might provide valuable insights, lessons learned, or even spark new ideas. Evaluating prior work can also prevent you from duplicating efforts or repeating the same mistakes.</p>\n<h4 class=\"\" id=\"terminology--names\">Terminology / names</h4>\n<p class=\"mb-4\">Every industry or project often has its own set of unique terms, names, or jargon. Familiarizing yourself with these terms can hugely impact your understanding of the project and improve your communication with stakeholders and team members. Trying to speak the same language as your users or clients can foster better understanding, and convey professionalism and competence.</p>\n<p class=\"mb-4\">When creating new things, often new names need to be invented. I try not to be too precious about this process. The key is to just pick a sensible name for a thing and stick to it, until a better taxonomy develops and it makes sense to rename it. It is often very difficult to rename things once the name has been embedded deeply into the code. Only the bravest developers rename existing variables, especially deeply-entrenched ones.</p>\n<h4 class=\"\" id=\"carefully-pick-your-tools\">Carefully pick your tools</h4>\n<p class=\"mb-4\">Not every project will require the same set of tools. Depending on the project's nature, the 'right' tools can hugely differ. It's important to identify and understand the tools available that could aid your project's development, whether they're software for task management, design tools, coding platforms, analytical tools, or even physical equipment if relevant. They can save time, increase efficiency, and provide new capabilities.</p>\n<p class=\"mb-4\">Often the most productive developers aren't the ones with the most experience or domain expertise, but those with the best set of tools for a particular problem.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"gather-data-and-explore\">Gather data and explore</h3>\n<p class=\"mb-4\">Data forms the backbone of any data visualization project. The type and amount of data needed will depend on the project's complexity and scope. Gathering useful data is a systematic process involving identifying data sources, collecting information, cleaning it, and then verifying its accuracy and relevance.</p>\n<p class=\"mb-4\">In the exploration phase, objective analysis of the gathered data can reveal patterns, trends, and insights that inform your project direction and strategy.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"metadata-whats-there-whats-missing\">Metadata: what’s there? What’s missing?</h3>\n<p class=\"mb-4\">As we navigate the development process, one crucial step is managing metadata - the information about our data. It's key in understanding the depth and quality of assembled data and integral to interpreting it correctly.</p>\n<p class=\"mb-4\">Observing what data exists and recognizing what's missing allows us to validate our data's completeness and reliability. Like a pre-flight checklist for a pilot, knowing your metadata and any gaps that exist helps you anticipate and mitigate any potential hiccups when using the data to drive your project decisions. It ensures the journey ahead relies on dependable, comprehensible information.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"go-wide-establish-possibilities\">Go Wide, Establish Possibilities</h3>\n<p class=\"mb-4\">In this stage of the process, the objective is to broaden the horizons of your project and explore as many possibilities as you can. This is the brainstorming phase where no idea is dismissed prematurely. Encourage out-of-the-box thinking and don't limit your exploration to just the tried-and-true.</p>\n<p class=\"mb-4\">This step might involve several techniques like:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\"><strong class=\"\">Mind Mapping:</strong> This visual tool can help you organize thoughts, ideas, and potential solutions related to your project.</li>\n<li class=\"\"><strong class=\"\">Prototyping:</strong> Quick hands-on experiments or simulations can provide insights on feasibility of ideas.</li>\n<li class=\"\"><strong class=\"\">Notebooks:</strong> Jotting down or sketching ideas can help retain them and facilitate deeper analysis later.</li>\n<li class=\"\"><strong class=\"\">Clients feedback and iteration loops:</strong> Engaging stakeholders at this stage can bring in fresh perspectives and align ideas better to actual needs.</li>\n</ul>\n<p class=\"mb-4\">By stretching the possibilities wide in this stage, you ensure you have multiple approaches or solutions to choose</p>\n<h4 class=\"\" id=\"visual-forms-for-data\">Visual Forms for data</h4>\n<p class=\"mb-4\">The use of visual forms in the exploration stage is instrumental. They convert raw data into insightful visuals, leading to an enhanced understanding and drastically improving the quality of the project:</p>\n<h5 class=\"\" id=\"numeric-values-scatterplot\">Numeric Values: Scatterplot</h5>\n<p class=\"mb-4\">Scatterplots illuminate trends or outliers in numeric data, providing a clear path to impactful solutions.</p>\n<h5 class=\"\" id=\"geographic-data-map\">Geographic Data: Map</h5>\n<p class=\"mb-4\">Maps transform location-based data into discernible patterns, opening up the landscape for strategic decisions.</p>\n<h5 class=\"\" id=\"data-with-time-line-chart-or-animation\">Data with Time: Line Chart or Animation</h5>\n<p class=\"mb-4\">Line charts or animations translate progression over time into visible trends, illuminating the path forward.</p>\n<h5 class=\"\" id=\"everything-tables\">Everything: Tables</h5>\n<p class=\"mb-4\">Our goal is not to visualize data just to make our work beautiful– sometimes the clearest way to convey some information is a simple humble table.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"make-a-prototype\">Make a prototype</h3>\n<p class=\"mb-4\">In the developmental journey, crafting a prototype is your first step towards making your project tangible. A prototype, often developed with Vue/Nuxt in my process, is a functional, interactive model that embodies your design vision.</p>\n<p class=\"mb-4\">A prototype primarily serves as a validation tool - a way to test design hypotheses, functionality, and gather initial user feedback. Prototypes might not encompass the full functionality of the final product and often focus on testing specific aspects of the design. As such, they're meant to be iterative, changed, and refined based on user feedback and testing outcomes.</p>\n<p class=\"mb-4\">An important distinction to make is between a prototype and a Minimum Viable Product (MVP). While they seem similar, their purpose and scope differ. An MVP is a pared-down version of your product that includes just the core features necessary to make it work and deliver value to users. It's more polished than a prototype and is generally used to see how the target audience responds to the product's main idea. While the prototype is more for internal validation of design ideas, an MVP is put in front of actual users.</p>\n<h4 class=\"\" id=\"designing-an-mvp\">Designing an MVP</h4>\n<p class=\"mb-4\">When designing a Minimum Viable Product (MVP), the goal is to develop a product with the smallest possible feature set that still delivers core value to the user. To achieve this, everything we've done so far comes into play.</p>\n<p class=\"mb-4\">The understanding gained from gathering context about user needs, project goals, and stakeholder requirements informs what your MVP must achieve. The data exploration and visual forms help you grasp the intricacies of the data your MVP will handle, influencing design decisions.</p>\n<p class=\"mb-4\">Starting with a mobile-first design helps focus on what's essential. On smaller screens, every element matters and unnecessary complexity can ruin user experience. This approach forces you to prioritize features, displaying only what's crucial on your MVP.</p>\n<p class=\"mb-4\">Using tools like Figma, create interactive high-fidelity prototypes to visualize the flow and feel of your MVP. Use it to try out different design possibilities and interaction patterns before committing any code.</p>\n<p class=\"mb-4\">It's important here to think in terms of problem-solving, not feature-building. Keep asking: what is the simplest solution that solves the problem for our users?</p>\n<p class=\"mb-4\">When defining the scope of your MVP, consider data prototypes too, especially for products involving complex data interactions. They allow you to test feasibility and performance early on.</p>\n<p class=\"mb-4\">At this stage, a key mantra should be: don't fall in love with your ideas. Be open to discard features or elements if they do not serve the primary goal of your MVP.</p>\n<p class=\"mb-4\">Ultimately, designing an MVP is about discerning what's absolutely necessary for your product to provide its core value, and having the discipline to say 'no' to everything else until after validating the MVP. It is a challenging process but essential in creating focused, valuable products while minimizing wasted efforts.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"visual-design-and-polish\">Visual design and polish</h3>\n<p class=\"mb-4\">Post-MVP, attention turns to enhancing user experience with aesthetics. It's more than just colors and fonts; it's about intuitive, consistent visuals that boost user engagement.</p>\n<p class=\"mb-4\">Visual design gives your product its aesthetic appeal, aligning it with the brand's identity and improving user experience. It includes aspects like color schemes, typography, iconography, layout and spacing, among others.</p>\n<p class=\"mb-4\">Polishing your product involves refining every element and interaction to make sure it's smooth, intuitive, and visually pleasing. It's about paying attention to small details like consistency in design elements, easy-to-read fonts, sensible animations, effective color contrasts, and so on.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"user-testing\">User Testing</h3>\n<p class=\"mb-4\">User testing is the pivotal phase where your product, the MVP you designed and polished, is put to the test in the hands of actual users. It provides crucial insights into its usability and any potential areas for improvement.</p>\n<h4 class=\"\" id=\"the-user-is-always-right\">The User is Always Right</h4>\n<p class=\"mb-4\">During user testing, one mantra to remember is: The user is always right. If users struggle with a certain feature or can't navigate through your app intuitively, it indicates that changes are needed. This feedback is invaluable in improving the product and enhancing user satisfaction. After all, a product that doesn't meet user needs or isn't user-friendly will struggle to find success.</p>\n<h4 class=\"\" id=\"be-open-to-big-pivots\">Be Open to Big Pivots</h4>\n<p class=\"mb-4\">It's also essential to remain open-minded and ready for change during this stage. Sometimes, user testing might reveal that significant changes (or pivots) are necessary for your product to work effectively. These pivots could range from minor feature tweaks to a complete overhaul of certain aspects. Being flexible and open to these big pivots can significantly improve your product's final version.</p>\n<h4 class=\"\" id=\"beginners-mind-is-invaluable\">Beginners Mind is Invaluable</h4>\n<p class=\"mb-4\">Approaching user testing with a 'beginner's mind' can be invaluable. This mindset allows you to observe and understand users' experiences without preconceived notions, helping identify pain points or difficulties a more experienced eye might overlook.</p>\n<h3 class=\"text-2xl font-medium mb-3 mt-6\" id=\"documenting-the-process\">Documenting the Process</h3>\n<p class=\"mb-4\">The process of developing a project is a journey filled with valuable insights, decisions, and iterations. Documenting this process serves several purposes:</p>\n<ul class=\"list-disc ml-6 mb-4\">\n<li class=\"\">It provides a historical record of your project, allowing you to trace back your steps, understand the decisions made, and learn from them.</li>\n<li class=\"\">It facilitates communication and transparency with stakeholders, clients or team members. They can see the progress made, understand the reasoning behind decisions, and contribute more effectively.</li>\n<li class=\"\">It's a great tool for reflection and learning. Looking back at your documentation can provide insights into your working style, efficiency, and areas for improvement.</li>\n</ul>\n<p class=\"mb-4\">There are several ways to document the process effectively:</p>\n<h4 class=\"\" id=\"screenshots\">Screenshots</h4>\n<p class=\"mb-4\">Visuals can communicate information quickly and intuitively. Regularly taking screenshots of your work - be it design drafts, code snippets, bug reports or user feedback - can create a rich visual timeline of your project.</p>\n<h4 class=\"\" id=\"working-in-public\">Working in Public</h4>\n<p class=\"mb-4\">Sharing your work progress publicly (e.g., on social media or a blog) not only serves as documentation but also invites feedback and creates accountability. It can foster community engagement and even attract potential users or clients.</p>\n<h4 class=\"\" id=\"working-in-semi-public\">Working in semi-Public</h4>\n<p class=\"mb-4\">Even if you aren't sharing your work publicly, you can \"liveblog\" your progress in your company's shared chat channels.</p>\n<h4 class=\"\" id=\"live-streaming\">Live-Streaming</h4>\n<p class=\"mb-4\">Live-streaming your work sessions is another form of real-time documentation. It gives people an inside look into your workflow and decision-making process. This transparency can build trust with clients or users and facilitate learning for others in your field.</p>",
  "title": "The Art of Coding: A Developer's Guide",
  "metadata": {
    "date": "2022-11-03T00:01:31.000Z",
    "modified": "2024-09-20T04:25:08.000Z",
    "dek": "In which we go into detail about how to write code to accomplish a goal",
    "inprogress": true,
    "tags": [
      "personal",
      "process",
      "design",
      "project",
      "coding"
    ],
    "words": 2443,
    "images": 1,
    "links": 8,
    "codeBlocks": 0,
    "headers": {
      "h2": 2
    },
    "toc": [
      {
        "text": "The Art of Coding: A Developer's Guide",
        "slug": "the-art-of-coding-a-developer-s-guide",
        "level": "h2",
        "children": []
      },
      {
        "text": "Establish a clear goal",
        "slug": "establish-a-clear-goal",
        "level": "h2",
        "children": [
          {
            "text": "User stories",
            "slug": "user-stories",
            "level": "h3",
            "children": []
          },
          {
            "text": "Acceptance criteria",
            "slug": "acceptance-criteria",
            "level": "h3",
            "children": []
          },
          {
            "text": "Deadline",
            "slug": "deadline",
            "level": "h3",
            "children": []
          },
          {
            "text": "Core principles",
            "slug": "core-principles",
            "level": "h3",
            "children": []
          },
          {
            "text": "Gather context",
            "slug": "gather-context",
            "level": "h3",
            "children": []
          },
          {
            "text": "Gather data and explore",
            "slug": "gather-data-and-explore",
            "level": "h3",
            "children": []
          },
          {
            "text": "Metadata: what’s there? What’s missing?",
            "slug": "metadata-what-s-there-what-s-missing",
            "level": "h3",
            "children": []
          },
          {
            "text": "Go Wide, Establish Possibilities",
            "slug": "go-wide-establish-possibilities",
            "level": "h3",
            "children": []
          },
          {
            "text": "Make a prototype",
            "slug": "make-a-prototype",
            "level": "h3",
            "children": []
          },
          {
            "text": "Visual design and polish",
            "slug": "visual-design-and-polish",
            "level": "h3",
            "children": []
          },
          {
            "text": "User Testing",
            "slug": "user-testing",
            "level": "h3",
            "children": []
          },
          {
            "text": "Documenting the Process",
            "slug": "documenting-the-process",
            "level": "h3",
            "children": []
          }
        ]
      }
    ],
    "type": "post",
    "sourcePath": "../../../../../code/website2/content/blog/blog/2022/the-art-of-coding.md",
    "sourceDir": "/Users/ejfox/Library/Mobile Documents/iCloud~md~obsidian/Documents/ejfox/"
  }
}