{
  "html": "<h2 class=\"\" id=\"overview-of-the-week\">Overview of the Week</h2>\n<ul class=\"list-disc\">\n<li class=\"\">Went to Geneseo for the eclipse</li>\n<li class=\"\">Road the motorcycle through a snowstorm for the first time; mild frostbite on my hands but proud of myself, my bike, and its tires</li>\n</ul>\n<h2 class=\"\" id=\"creative-endeavors\">Creative Endeavors</h2>\n<ul class=\"list-disc\">\n<li class=\"\">Did a bunch of watercolors while hanging out with friends; at my friend's house, at the lake in Geneseo</li>\n</ul>\n<h2 class=\"\" id=\"books-movies-tv\">Books, Movies, TV</h2>\n<ul class=\"list-disc\">\n<li class=\"\">Adrienne made us all watch \"Irish Wish\" with Lindsay Lohan- it was basic, but enjoyable, and it was fun to track the Hero's Journey on a story circle like keeping score at a baseball game</li>\n</ul>\n<h2 class=\"\" id=\"goals-for-the-future\">Goals for the Future</h2>\n<ul class=\"list-disc\">\n<li class=\"\">I want to make it easier for me to write these weekly summaries based on my screenshots, bookmarks, and Mastodon tweets and an LLM to help categorize and summarize each week's efforts and tie them into larger projects and goals</li>\n<li class=\"\">I'd also love a way to automate text descriptions of all of my screenshots- which are already automatically uploaded to Cloudinary. I just need a webhook when a new image is uploaded that sends it GPT4-vision and asks for a description, then update the Cloudinary asset</li>\n<li class=\"\">I really need a better way of asset management within Obsidian. I don't want to be depending on the binary images in the folder, and basically I want to convert images to Cloudinary links as soon as possible and use Cloudinary as my lingua-franca for image/video/audio assets- but right now, things fall out of sync, and I think I need an Obsidian plugin to handle it for me</li>\n<li class=\"\">Add a section to my website for music, beats, and audio experiments and creations</li>\n</ul>",
  "title": "2024 15",
  "metadata": {
    "tags": [
      "weekly-notes",
      "reflections",
      "progress",
      "motorcycle",
      "art",
      "automation",
      "music"
    ],
    "date": "2022-12-26T16:57:44.000Z",
    "modified": "2024-10-14T23:51:56.000Z",
    "dek": "In which the author braves a snowstorm on their motorcycle, enjoys watercolor painting with friends, indulges in a Lindsay Lohan movie night, and charts plans for automated text descriptions of screenshots and improved asset management in Obsidian.",
    "words": 279,
    "images": 0,
    "imageDetails": {
      "total": 0,
      "cloudinary": 0,
      "withDimensions": 0
    },
    "links": 0,
    "codeBlocks": 0,
    "headers": {},
    "toc": [],
    "type": "post",
    "sourcePath": "../../../../../code/website2/content/blog/week-notes/2024-15.md",
    "sourceDir": "/Users/ejfox/Library/Mobile Documents/iCloud~md~obsidian/Documents/ejfox/"
  }
}
