{
  "slug": "2022/everyone-should-code-data-literacy",
  "title": "Why I think everyone should learn to code",
  "date": "2022-11-03T00:02:01.000Z",
  "type": "post",
  "html": "<h2 id=\"why-i-think-everyone-should-learn-to-code\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#why-i-think-everyone-should-learn-to-code\"><span class=\"icon icon-link\"></span></a>Why I think everyone should learn to code</h2>\n<p>![[1312706448_An_award_winning_lineart_illustration_of_a_student_coding_on_a_laptop__programming_language_syntax_i.png]]</p>\n<h3 id=\"defining-computer-literacy\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#defining-computer-literacy\"><span class=\"icon icon-link\"></span></a>Defining computer literacy</h3>\n<p>The ability to understand the ways that computers operate; if/else statements, networks, looping, and the ease of scale.</p>\n<p>You can gain a lot of this through intuition. The best way to learn is to accomplish a task that provides a function beyond the sheer learning itself. Some of the first computer networks and mailing lists were used to trade recordings of Grateful Dead shows. In this same vein, a student who wants to track baseball scores or their anime library or create a website for their album will learn the fundamentals as their project progresses naturally.</p>\n<p>It is not remembering the name of obscure tools, functions, or frameworks.</p>\n<p>[[drafts/approach-to-learning]]</p>\n<h3 id=\"learning-to-google-magic-words\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#learning-to-google-magic-words\"><span class=\"icon icon-link\"></span></a>Learning to google “Magic Words”</h3>\n<p>Once you know what something is called, you can usually find enough resources to understand it, and maybe even a few examples of how to use it. The difficult thing, often described as “domain expertise” is knowing what things are called in a particular industry, field, or tool.</p>\n<p>So there is a meta-skill that sits on top of learning any technology; if you can reliably discover and research the “magic words” you need, you can teach yourself almost anything as a result.</p>\n<h3 id=\"noticing-when-you-feel-like-a-robot\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#noticing-when-you-feel-like-a-robot\"><span class=\"icon icon-link\"></span></a>Noticing when you feel like a robot</h3>\n<p>Sometimes I will find myself doing an arduous and repetitive task. When I find myself repeating a loop of tasks more than a few times, I sit back and think how long it would take to automate that task. Then I think about how many times I will probably do that task by hand, and weigh those things together. If I can save time by writing some code to make it faster, I almost always will. This type of broken brain is called being a hacker.</p>\n<h3 id=\"communicating-with-artificial-intelligence\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#communicating-with-artificial-intelligence\"><span class=\"icon icon-link\"></span></a>Communicating with Artificial Intelligence</h3>\n<p>See [[how-i-use-gpt3]] and [[how-i-use-stable-diffusion]] for more.</p>\n<h3 id=\"appreciating-the-i-can-do-that-moments\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#appreciating-the-i-can-do-that-moments\"><span class=\"icon icon-link\"></span></a>Appreciating the “I can do that” moments</h3>\n<p>There is a profound feeling that comes with the realization that you can make a computer do what you want it to. It’s like a lightbulb moment, and it’s addicting.</p>\n<p>You start to see automation possibilities everywhere. You can make a computer do the things that are tedious, repetitive, or just plain annoying. This is the skill that allows you to take a problem and break it down into small, manageable pieces that a computer can understand.</p>\n<h3 id=\"control-of-the-world-around-you\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#control-of-the-world-around-you\"><span class=\"icon icon-link\"></span></a>Control of the world around you</h3>\n<p>With coding, you have the ability to define the world around you. In a very real sense, you can make the world work the way you want it to.</p>\n<p>Of course, you can’t do everything, but the ability to code gives you a lot of power to shape the world to your liking. [[the-internet-was-built-to-be-hacked]]</p>\n<h3 id=\"making-your-work-easier\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#making-your-work-easier\"><span class=\"icon icon-link\"></span></a>Making your work easier</h3>\n<p>Coding can make your work easier in all sorts of ways. Automating repetitive tasks, for example, can save you a lot of time and effort.</p>\n<p>But coding can also make your work easier in more subtle ways. For example, learning to code can help you become more organized and systematic in your thinking. This can make it easier to solve problems and to communicate your ideas to others.</p>\n<h3 id=\"improving-your-career-prospects\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#improving-your-career-prospects\"><span class=\"icon icon-link\"></span></a>Improving your career prospects</h3>\n<p>Coding skills are in high demand. Or they can help you start your own business. If you have an idea for a new app or website, you can bring it to life yourself.</p>\n<h3 id=\"having-a-set-of-tools-that-are-ready\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#having-a-set-of-tools-that-are-ready\"><span class=\"icon icon-link\"></span></a>Having a set of tools that are ready</h3>\n<p>Once you have learned to code, you have a set of tools at your disposal that can be utilized for a wide range of tasks. From data analysis to web development, the possibilities are endless.</p>\n<p>From there you can build a computer setup (like [[computer-setup]]) that has your tools ready to go for when you get an idea for a project.</p>",
  "modified": "2024-09-20T04:24:42.000Z",
  "description": "",
  "dek": "In which we explore the transformative potential of computer literacy, unearthing its capacity to elevate both individual lives and collective progress",
  "url": "",
  "tags": [
    "code",
    "automation",
    "tech"
  ],
  "hidden": false,
  "draft": true,
  "wordCount": 645,
  "readingTime": 3,
  "imageCount": 0,
  "linkCount": 0,
  "share": true
}