{
  "slug": "2022/the-studio",
  "title": "Fox Studio (Beacon)",
  "date": "2022-12-27T20:04:55.000Z",
  "type": "post",
  "html": "<h2 id=\"fox-studio-beacon\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#fox-studio-beacon\"><span class=\"icon icon-link\"></span></a>Fox Studio (Beacon)</h2>\n<p>For specifics on the art materials and tools I use: [[art-setup]]</p>\n<p>Inspired by Tom Sachs' studio rules: <a href=\"https://www.youtube.com/watch?v=49p1JVLHUos\">Tom Sachs: 10 Bullets</a></p>\n<h3 id=\"studio-goals\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#studio-goals\"><span class=\"icon icon-link\"></span></a>Studio goals</h3>\n<p>The goal of the studio is to make work that we are proud of, that makes the world a better place. We know that we can make bigger, cooler things faster if we work together. We work with like-minded people whose ideals and success we are invested in. We emphasize kindness and respect and we despise artificial hierarchies.</p>\n<p>Together, we are powerful.</p>\n<h3 id=\"studio-agreements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#studio-agreements\"><span class=\"icon icon-link\"></span></a>Studio Agreements</h3>\n<p><a href=\"https://mastodon.social/@ejfox/109614942434120048\">Studio Agreements on Mastodon</a></p>\n<h4 id=\"1-we-get-something-down\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#1-we-get-something-down\"><span class=\"icon icon-link\"></span></a>1. We get something down</h4>\n<p>Whether recording music or making visual art, the hardest and least-important part is starting. Once it is time to create, make some sort of mark. It can be refined and corrected thereafter. It can even be a mistake that ruins the whole work. That is fine. Another work will be created next- but only if you get something down first.</p>\n<p>A blank canvas must be met, immediately, with a mark of some kind. You worry that it is not the right mark, not in the right place, that you will ruin the entire thing with the first stroke. Begin.</p>\n<h4 id=\"2-we-follow-our-intuition\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#2-we-follow-our-intuition\"><span class=\"icon icon-link\"></span></a>2. We follow our intuition</h4>\n<p>Following intuition is not always a natural process, not as easy as a faucet turned on and off. Creating art with new collaborators requires feeling the power of the studio as a sacred altar to the act of creation. Every act of earnest creation is correct. Intuition needs to feel safe to speak loudly enough for us to hear it.</p>\n<p>Every artist has different rituals, though many involve coffee. Creating the space to follow intuition is [[step-zero]] for creating the work. If the intuition is quiet today, get something down on the page until it wakes up.</p>\n<h4 id=\"3-we-verbalize-our-plans\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#3-we-verbalize-our-plans\"><span class=\"icon icon-link\"></span></a>3. We verbalize our plans</h4>\n<p>In programming there is <a href=\"https://en.wikipedia.org/wiki/Rubber_duck_debugging\">Rubber Duck Debugging</a> where speaking your problem aloud allows you to understand it better. Explaining your plan and thinking in the studio can have the same results and allow for more intention and better collaboration.</p>\n<p>This sits in tension with the fact that motivations, often when rooted in intution, are hard to verbalize. \"I feel deeply that I <em>need</em> to do <em>this</em>\" is often explanation enough- but getting to the point where you understand where motivation is coming from and putting it into words for your collaborators is its own art.</p>\n<p>Verbalizing a plan is as much for you to understand what you are doing as the people as you are speaking to.</p>\n<h4 id=\"4-we-dont-sweat-the-details-until-its-details-time\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#4-we-dont-sweat-the-details-until-its-details-time\"><span class=\"icon icon-link\"></span></a>4. We don't sweat the details (until it's details time)</h4>\n<p>When creating work, mentally envision a block of stone being sketched on, carved into geometric shapes, and then slowly whittled down. Know which stage of a project you are in, and speak it aloud. Complete a first draft before you edit what you have written. Get a perfect 8 bar loop for the chorus before you arrange the song. Complete your sketch before you begin painting. Get your prototype working before you pick a color scheme. Never paint without a sketch or thumbnail.</p>\n<h4 id=\"5-we-make-bad-things-so-we-can-make-good-things\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#5-we-make-bad-things-so-we-can-make-good-things\"><span class=\"icon icon-link\"></span></a>5. We make bad things so we can make good things</h4>\n<p>It is often the 2nd or 3rd thing I make that I am really proud of. There is wisdom in this that all of the agreements tie back to: get momentum and make the work. Even if you hate the first draft, treat it like a warm-up and a loosening of muscles. Your reward for finishing your work is more work, where you can do it better.</p>\n<h4 id=\"6-we-follow-the-templates-and-protocols\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#6-we-follow-the-templates-and-protocols\"><span class=\"icon icon-link\"></span></a>6. We follow the templates and protocols</h4>\n<p>A lot of work has been spent on finding specific tools: for every pen or brush there are thousands of pens and brushes that were considered but not chosen. That should be understood in every detail of the studio. The DNA of the studio is in the tools chosen, the absence of the tools that were not chosen, and the magic of limitations. If a color is missing; no, it's not. That is a limitation that was designed to push our creativity in one direction or another, often with intentionality.</p>\n<p>We treat each other with respect and kindness. This protocol is non-negotiable. We build and create through disagreements. We center kindness in ways that the world often does not, and that is what allows us to create.</p>\n<p>This does not mean the studio cannot be improved; it must always be improved. But that improvement must be done, with intention, in \"studio improvement\" time, not \"be creative\" time. Time in the studio should be used creating work. Life is short, use the templates and protocols.</p>\n<h4 id=\"7-we-ask-for-what-we-need\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#7-we-ask-for-what-we-need\"><span class=\"icon icon-link\"></span></a>7. We ask for what we need</h4>\n<p>You will be surprised by what might be available, hidden in a drawer or high up on a shelf or in someone's bag. Creativity thrives when our base comforts are met; I almost always have a coffee or tea or seltzer while I work, and if you enjoy those things, you should too.</p>\n<p>If space or breaks or quiet is needed, it merely needs to be spoken aloud.</p>\n<h4 id=\"8-we-understand-the-time-we-have\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#8-we-understand-the-time-we-have\"><span class=\"icon icon-link\"></span></a>8. We understand the time we have</h4>\n<p>What can be done in an hour? A day? A week? Do not bite off more than you can chew. This rule is always broken.</p>\n<h4 id=\"9-we-do-not-keep-secrets\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#9-we-do-not-keep-secrets\"><span class=\"icon icon-link\"></span></a>9. We do not keep secrets</h4>\n<p>We do not keep secrets from each other, ourselves, or the outer world. Nothing we do is precious enough to keep secrets about. None of our techniques need to be hidden. We know the power of sharing our work with the world, and the inumerable benefits that come from giving openly to anyone who asks.</p>\n<h4 id=\"10-we-throw-things-out\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#10-we-throw-things-out\"><span class=\"icon icon-link\"></span></a>10. We throw things out</h4>\n<p>Because we experiment, by nature we go down paths that do not aid our goals. This means that we often create things we don't actually want. We must not be precious about these things. When they are digital, they can be luckily filed away on some server somewhere and recalled later. If they are physical; they must be gifted, sold, or thrown away. The space those things take up is more valuable when it is empty- the emptiness leaves space to create more. Because of this, we must gleefully rid ourselves of our previous work, before we grow to hate it, or even worse.</p>\n<hr>\n<h3 id=\"appendix-brass-tacks-etcetera\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#appendix-brass-tacks-etcetera\"><span class=\"icon icon-link\"></span></a>Appendix, brass tacks, etcetera</h3>\n<h4 id=\"we-have-data-in-hand-before-we-start-data-driven-projects\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#we-have-data-in-hand-before-we-start-data-driven-projects\"><span class=\"icon icon-link\"></span></a>We have data in hand before we start data-driven projects</h4>\n<p>The promise of data is not data. A data schema is not data. As data visualizers, we need data in order to do our jobs. All of the data. Actually, more data than you actually want to see. It is often very tempting to break this rule; don't do it. Work cannot start until the data is in-hand.</p>\n<h4 id=\"we-always-label-our-layers-and-files-with-care\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#we-always-label-our-layers-and-files-with-care\"><span class=\"icon icon-link\"></span></a>We always label our layers and files with care</h4>\n<p>When working in Illustrator, Photoshop, After Effects, Figma, or any other tool that allows you to name layers as you work. Take the time to label the layers. Do not hold yourself to a high standard for names. You don't need a deep organization system, and you may need to change the name later, but any name is better than no name.</p>\n<p>When naming a file or variable, take a second to think of how it could be confused, what makes that thing unique, and how someone with zero context would understand the name. Nothing should be named \"data\", for example.</p>\n<p>Names should be based on what a thing accomplishes- not what it looks like. \"Background\", not \"red square\". \"Home Button\", not \"rounded rectangle 1\" - that way names will still be applicable through multiple versions, iterations, and styles.</p>\n<h4 id=\"we-always-test\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#we-always-test\"><span class=\"icon icon-link\"></span></a>We always test</h4>\n<p>A good portion of doing the work is testing that the work… works. We are not done until it is tested in the usual ways. Then the unusual ways. The testing helps us work fast, knowing that we will catch any side effects later. When the deadline is reduced, it means we build less and test the same amount. Testing cannot be a victim to the deadline.</p>",
  "modified": "2024-06-21T14:13:59.000Z",
  "description": "",
  "dek": "In which we state our values upfront such that we might collaborate more effectively",
  "url": "",
  "tags": [
    "art",
    "design",
    "inspiration",
    "process",
    "technique",
    "tool",
    "visualization"
  ],
  "hidden": true,
  "draft": false,
  "wordCount": 1361,
  "readingTime": 6,
  "imageCount": 0,
  "linkCount": 3,
  "share": true
}