{
  "slug": "reading/Bobrick-The Fated Sky",
  "title": "The Fated Sky",
  "date": "2022-12-14T20:25:13.000Z",
  "type": "reading",
  "html": "<h1 id=\"the-fated-sky\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#the-fated-sky\"><span class=\"icon icon-link\"></span></a>The Fated Sky</h1>\n<p>#astrology</p>\n<h1 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\"><span class=\"icon icon-link\"></span></a>Metadata</h1>\n<ul>\n<li>\n<p>Author: <a href=\"https://www.amazon.com/Benson-Bobrick/e/B000AP7XK0/ref=dp_byline_cont_ebooks_1\">Benson Bobrick</a></p>\n</li>\n<li>\n<p>ASIN: B000FCKKXA</p>\n</li>\n<li>\n<p>ISBN: 0743224825</p>\n</li>\n<li>\n<p>Reference: <a href=\"https://www.amazon.com/dp/B000FCKKXA\">https://www.amazon.com/dp/B000FCKKXA</a></p>\n</li>\n<li>\n<p><a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA\">Kindle link</a></p>\n</li>\n</ul>\n<h1 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\"><span class=\"icon icon-link\"></span></a>Highlights</h1>\n<p>After Christ was crucified, dead, and buried, he ascended into heaven after three days. Just so, the Sun remains for three days in transit at the equinoctial point before it begins its ascent into the northern hemisphere. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=230\">230</a> ^ref-6883</p>\n<hr>\n<p>power based their actions on astrological advice. It is said that the Incas submitted to the Spanish almost without a fight because the arrival of the conquistadors happened to coincide with an astrological prophecy that their civilization was coming to an end. Depending on how one cares to interpret this, the prophecy fulfilled itself or, by acquiescence, was fulfilled. Either way, astrology had power. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=259\">259</a> ^ref-28834</p>\n<hr>\n<p>The indisputable power of the Sun over all living things, the Moon’s effect on the tides, the repetition of weather patterns such as the stormy periods around the equinoxes, or the coincidence between the rising of Sirius, the Dog Star, and the summer’s hottest weeks—helped to make plausible the impact of the planets and stars. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=908\">908</a> ^ref-61055</p>\n<hr>\n<p>Roger Bacon, a Franciscan and the greatest scientist the Middle Ages produced, was expert in judicial or mundane astrology, which seeks to correlate planetary cycles and patterns with world events, and devoted to the study of “elections.” — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=1483\">1483</a> ^ref-64676</p>\n<hr>\n<p>Another garbled astrological idea was that certain days in the month were automatically auspicious while others brought ill luck. These were sometimes presented in tabular form for reference, as in a table ascribed to Tycho Brahe, which he had supposedly left in a monastery wall on Hven. It contained thirty-two days in the year when “nothing important should be undertaken or brought to term.” — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=3165\">3165</a> ^ref-40417</p>\n<hr>\n<p>Shakespeare is expert in astrology here, and letting the knowledgeable reader know that Edmund was born under just those aspects that in fact describe who he is—a perverse and degenerate soul. Unlike Sir Toby and Sir Andrew, Shakespeare had his astrology right. Edmund’s position is that of the modern “realist”: a person born with any other horoscope would be the same. That sounds perfectly sensible to us, because Edmund’s point of view is the respectable one today. But to Lear the disparate characters of his three daughters can only be explained by the astrological distinctions at their birth. “It is the stars / The stars above us,” he cries, “govern our conditions; / Else one self mate and make could not beget / Such different issues.” If Shakespeare had wanted to debunk astrology he would have given Edmund a wholly different chart. In sifting all this, it might be useful to remember Juliet’s famous lines: “What’s in a name? that which we call a rose / By any other name would smell as sweet.” Readers today tend to take that as common sense. But there, too, Shakespeare is playing another game. In the play, it turns out that there is a great deal in a name: in Verona, the names of “Montague” or “Capulet” could get you killed. As often as not, he is teaching the audience to rethink some common assumption they are prone to make. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=3231\">3231</a> ^ref-43982</p>\n<hr>\n<p>“If you do but consider the whole universe,” he wrote, “as one united body, and man as an epitome of this body, it will seem strange to none but madmen and fools that the stars should have influence upon the body of man, considering he, be[ing] an epitome of the Creation, must needs have a celestial world written in himself…Every inferior world is governed by its superior, and receives influence from it.” — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=3564\">3564</a> ^ref-38112</p>\n<hr>\n<p>Two years later, he published an important guide,The Astrological Judgment of Diseases, as well asA Directory for Midwives, with advice for women and mothers at every stage of their childbearing years. His magnum opus, however, appeared in 1653. This wasThe English Physician, or an Astrologo-physical Discourse on the Vulgar [Common] Herbs of This Nation, a compendious astrological primer for herbal cures. Known today asCulpeper’s Herbal, it is the only book in English other than the King James Bible from the 1600s that has been continually in print since it appeared. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=3572\">3572</a> ^ref-25012</p>\n<hr>\n<p>there is no fatal necessity in the stars; but that they rather incline than compel. We will add one thing more (wherein I shall certainly seem to take part with astrology, if it were reformed); that we are certain the celestial bodies have other influences besides light and heat. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=4095\">4095</a> ^ref-9227</p>\n<hr>\n<p>In an essay entitled “Of Celestial Influences or Effluviums in the Air,” he expressed his stubborn conviction that “celestial bodies (according to the angles they make upon one another, but especially with the sun or with the earth in our meridian, or with such and such other points in the heavens) may have a power to cause such…changes, and alterations…that shall at length be felt in every one of us.” — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=4110\">4110</a> ^ref-30807</p>\n<hr>\n<p>At the same time, being wholly traditional in some things, Gadbury regarded comets as “beacons, whose use and office is to give warning to mankind of approaching dangers.” — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=4185\">4185</a> ^ref-39156</p>\n<hr>\n<p>Though death was his special dominion, he could also be right on other fronts. Eleven years before the defeat of Napoleon at Waterloo, Worsdale predicted that if Napoleon Bonaparte and the Duke of Wellington ever met in battle, Napoleon would lose. He thought so because Wellington’s tenth-house Jupiter was exactly conjunct the place occupied by Saturn in Napoleon’s chart. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=4368\">4368</a> ^ref-58115</p>\n<hr>\n<p>Their disposition, as to modest or vicious habits, very much depends on the positions and configurations of Mars, for, if he be separating from Saturn and Venus, and applying to Jupiter, men born at that time will be discreet and modest, decent in their intercourses with the other sex, and disposed only to the natural use. If Jupiter and Venus be configurated to Saturn and Mars, the native will be easily moved on, and have a secret desire to acts of venery; but will have an external show of chastity, and labor to avoid the shame. If Mars and Venus are alone configurated together, or if Jupiter bears testimony, the native will be openly lascivious, and indulge in the most luxuriant enjoyments of the opposite sex. — location: <a href=\"kindle://book?action=open&#x26;asin=B000FCKKXA&#x26;location=4405\">4405</a> ^ref-64467</p>\n<hr>",
  "modified": "2022-12-23T14:45:29.000Z",
  "description": "",
  "dek": "",
  "url": "",
  "tags": [],
  "hidden": false,
  "draft": false,
  "wordCount": 1079,
  "readingTime": 5,
  "imageCount": 0,
  "linkCount": 15,
  "share": true
}