{
  "slug": "reading/Broder-So Sad Today",
  "title": "So Sad Today",
  "date": "2022-12-14T20:25:18.000Z",
  "type": "reading",
  "html": "<h1 id=\"so-sad-today\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#so-sad-today\"><span class=\"icon icon-link\"></span></a>So Sad Today</h1>\n<p>#poetry</p>\n<h1 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\"><span class=\"icon icon-link\"></span></a>Metadata</h1>\n<ul>\n<li>\n<p>Author: <a href=\"https://www.amazon.com/Melissa-Broder/e/B003AOS5RI/ref=dp_byline_cont_ebooks_1\">Melissa Broder</a></p>\n</li>\n<li>\n<p>ASIN: B011J4H1NO</p>\n</li>\n<li>\n<p>ISBN: 1455562726</p>\n</li>\n<li>\n<p>Reference: <a href=\"https://www.amazon.com/dp/B011J4H1NO\">https://www.amazon.com/dp/B011J4H1NO</a></p>\n</li>\n<li>\n<p><a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO\">Kindle link</a></p>\n</li>\n</ul>\n<h1 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\"><span class=\"icon icon-link\"></span></a>Highlights</h1>\n<p>Well-meaning people can save me from myself, but they cannot save me from being alive. Only my god can do that. Sometimes my god speaks through well-meaning people. Sometimes I am so lonely. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=357\">357</a> ^ref-60693</p>\n<hr>\n<p>Well-meaning people can save me from myself, but they cannot save me from being alive. Only my god can do that. Sometimes my god speaks through well-meaning people. Sometimes I am so lonely. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=357\">357</a> ^ref-60693</p>\n<hr>\n<p>help. My god is a horizontal god who works sideways on earth rather than vertically from heaven down. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=654\">654</a> ^ref-64092</p>\n<hr>\n<p>When I’m sleeping, the committee stays up all night and then greets me at dawn with really bad ideas. It’s like, Good morning! Everything is shit! Time to act impulsively. But first let’s start by getting into fights with imaginary people from the past. Next let’s catalog everything that’s wrong with you and your life. Also, I want to remind you of everything you don’t have—and everything you should be scared of losing. Let’s begin. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=685\">685</a> ^ref-22508</p>\n<hr>\n<p>I preferred to chain-smoke in isolation rather than not smoke among others. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=918\">918</a> ^ref-12020</p>\n<hr>\n<p>And while the gum may have an adverse effect on my physical heart, it does wonders for my emotional one. It ballasts and buffers, nurtures and excites. I guess I value my emotional heart more. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=935\">935</a> ^ref-18641</p>\n<hr>\n<p>I still hold a somewhat sacred sexual ideal: a union where I experience orgasm with another person based solely on what is happening in the moment, and not on what is going on in my head. I’ve — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1018\">1018</a> ^ref-63800</p>\n<hr>\n<p>I’M TRYING TO QUIT GETTING high on people. It’s really fucking hard. I’m a romantic and an addict. I crave eros, fantasy, and intrigue. I’m wired for longing. But I keep getting really sick. Longing-sick. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1025\">1025</a> ^ref-31404</p>\n<hr>\n<p>The truth is, distance and unavailability—flecked with short-lived, gorgeous IRL binges—were what made the drug-person so intoxicating. I wanted more of the drug-person than could ever be available. When I didn’t get a text, I was, as junkies say, sick. When I received a text it made me well. But it only made me well until the next text I sent. Then I was waiting for him. I was sick again. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1042\">1042</a> ^ref-62140</p>\n<hr>\n<p>It was then I realized that he, too, is probably an addict of some sort. Anyone who can meet my level of intensity can’t be totally normal. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1068\">1068</a> ^ref-17840</p>\n<hr>\n<p>It was the least satisfying ending ever. Now I want to contact him and be like, Just one more thing! I want to give it the perfect ending. But there will never be a perfect ending. The perfect ending is a romantic ending and thus is not an ending. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1083\">1083</a> ^ref-4419</p>\n<hr>\n<p>But now I am sick again. I have holes in my brain where I want to hide from life. The holes are filled with voices that tell me we were nirvana, over and over. The voices seem like truth to me, because I am an addict and I want being high to be the truth. I don’t know if I will ever fill the holes. But I am trying really hard not to enter them again. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1086\">1086</a> ^ref-55964</p>\n<hr>\n<p>As has been said, I am not a human being trying to be spiritual. I am a spiritual being having a human experience. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1131\">1131</a> ^ref-44159</p>\n<hr>\n<p>One form of romantic obsession is to become infatuated with someone who actually exists. With this type of romantic obsession, you project your entire fantasy narrative onto a person in your life and attempt to get them to comply. You take a living, breathing human being and try to stuff them into the insatiable holes inside you. These holes are in no way shaped like that person (or any person). But you believe that this fantasy person will fill you, because he or she possesses all the imaginary qualities you seek in a lover. And how do you know that he or she possesses all of these qualities? You put them there. — location: <a href=\"kindle://book?action=open&#x26;asin=B011J4H1NO&#x26;location=1350\">1350</a> ^ref-9406</p>\n<hr>",
  "modified": "2022-12-23T14:45:17.000Z",
  "description": "",
  "dek": "",
  "url": "",
  "tags": [],
  "hidden": false,
  "draft": false,
  "wordCount": 732,
  "readingTime": 3,
  "imageCount": 0,
  "linkCount": 16,
  "share": true
}