{
  "slug": "reading/Campbell_et_al-The Hero’s Journey",
  "title": "The Hero’s Journey",
  "date": "2022-12-14T20:25:29.000Z",
  "type": "reading",
  "html": "<h1 id=\"the-heros-journey\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#the-heros-journey\"><span class=\"icon icon-link\"></span></a>The Hero’s Journey</h1>\n<p>#journalism #writing</p>\n<h1 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\"><span class=\"icon icon-link\"></span></a>Metadata</h1>\n<ul>\n<li>\n<p>Author: <a href=\"https://www.amazon.com/Joseph-Campbell/e/B000AQ33DK/ref=dp_byline_cont_ebooks_1\">Joseph Campbell, Phil Cousineau, David Kudler, and Stuart L. Brown</a></p>\n</li>\n<li>\n<p>ASIN: B07K5KBWGZ</p>\n</li>\n<li>\n<p>ISBN: 1608681890</p>\n</li>\n<li>\n<p>Reference: <a href=\"https://www.amazon.com/dp/B07K5KBWGZ\">https://www.amazon.com/dp/B07K5KBWGZ</a></p>\n</li>\n<li>\n<p><a href=\"kindle://book?action=open&#x26;asin=B07K5KBWGZ\">Kindle link</a></p>\n</li>\n</ul>\n<h1 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\"><span class=\"icon icon-link\"></span></a>Highlights</h1>\n<p>The pipe is a kind of portable altar, and when it’s lighted it’s not being smoked for fun, typically, but as a sacred act. When it is lighted the incense is, as it were, going to heaven. The pipe stem is lifted so that the sun smokes first, then it’s addressed to the four quarters so you know where you are: the central mountain is right here, which is everywhere. And the celebrant smokes and then the pipe is passed around. This orientation of the quarters, I guess one could say, is the basic high cultural myth form: the center, the quarters. And then wherever you go: find the center. That establishes the sacred point, where the high point is, and then you have the four quarters. — location: <a href=\"kindle://book?action=open&#x26;asin=B07K5KBWGZ&#x26;location=884\">884</a> ^ref-37052</p>\n<hr>\n<p>And yet this other thing had been built in. The problem was to work it out without losing the symbols. Joyce helped release me into an understanding of the universal sense of these symbols, the deep human sense. Not the anecdotal historical symbolization of the sense of these great universal symbols that come to us through our Christian heritage. But on the wings of art, an opening out of a mythological reading of these symbols. — location: <a href=\"kindle://book?action=open&#x26;asin=B07K5KBWGZ&#x26;location=1174\">1174</a> ^ref-65380</p>\n<hr>\n<p>Reading what you want, and having one book lead to the next, is the way I found my discipline. I’ve suggested this to many of my students: When you find a writer who really is saying something to you, read everything that writer has written and you will get more education and depth of understanding out of that than reading a scrap here and a scrap there and elsewhere. Then go to people who influenced that writer, or those who were related to him, and your world builds together in an organic way that is really marvelous. Whereas the way these things are taught normally in college and school is a sampler of what this one wrote and that one wrote and you’re asked to be more interested in the date of the publication of Keats’s sonnets than in what’s in them. — location: <a href=\"kindle://book?action=open&#x26;asin=B07K5KBWGZ&#x26;location=1667\">1667</a> ^ref-45450</p>\n<hr>\n<p>And I didn’t have to write a thesis. I didn’t have to write anything. All I did was underline sentences and take notes. It’s funny, I spent about forty years taking notes—I have fourteen file drawers packed full of notes—and I never bother with them now anymore. The thing comes in that way. — location: <a href=\"kindle://book?action=open&#x26;asin=B07K5KBWGZ&#x26;location=1707\">1707</a> ^ref-43271</p>\n<hr>\n<p>CAMPBELL: An artist is not in the field to achieve, to realize, but to become fulfilled. It’s a life-fulfilling, totally different structure. — location: <a href=\"kindle://book?action=open&#x26;asin=B07K5KBWGZ&#x26;location=2427\">2427</a> ^ref-31755</p>\n<hr>",
  "modified": "2022-12-23T16:04:35.000Z",
  "description": "",
  "dek": "",
  "url": "",
  "tags": [
    "writing",
    "book",
    "inspiration",
    "education",
    "meditation"
  ],
  "hidden": false,
  "draft": false,
  "wordCount": 479,
  "readingTime": 2,
  "imageCount": 0,
  "linkCount": 7,
  "share": true
}