{
  "slug": "reading/Doctorow-Walkaway",
  "title": "Walkaway",
  "date": "2022-12-14T20:24:13.000Z",
  "type": "reading",
  "html": "<h1 id=\"walkaway\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#walkaway\"><span class=\"icon icon-link\"></span></a>Walkaway</h1>\n<p>#fiction</p>\n<h1 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\"><span class=\"icon icon-link\"></span></a>Metadata</h1>\n<ul>\n<li>\n<p>Author: <a href=\"https://www.amazon.com/Cory-Doctorow/e/B001I9RSKC/ref=dp_byline_cont_ebooks_1\">Cory Doctorow</a></p>\n</li>\n<li>\n<p>ASIN: B01FQQ47OC</p>\n</li>\n<li>\n<p>Reference: <a href=\"https://www.amazon.com/dp/B01FQQ47OC\">https://www.amazon.com/dp/B01FQQ47OC</a></p>\n</li>\n<li>\n<p><a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC\">Kindle link</a></p>\n</li>\n</ul>\n<h1 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\"><span class=\"icon icon-link\"></span></a>Highlights</h1>\n<p>“His beliefs don’t start with the idea that it’s okay to kid yourself you’re a special snowflake who deserves more cookies than all the other kids. It starts with the idea that it’s human nature to kid yourself and take the last cookie, so if he doesn’t, someone else will, so he had better be the most lavishly self-deluded of all, the most prolific taker of cookies, lest someone more horrible, immoral, and greedy than he gets there first and eats all the cookies, takes the plate, and charges rent to drink the milk.” — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=759\">759</a> ^ref-29500</p>\n<hr>\n<p>“Look, there are as many walkaway philosophies as there are walkaways, but mine is, ‘the stories you tell come true.’ If you believe everyone is untrustworthy, you’ll build that into your systems so that even the best people have to act like the worst people to get anything done. If you assume people are okay, you live a much happier life.” — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=1377\">1377</a> ^ref-38068</p>\n<hr>\n<p>“That’s the walkaway dilemma. If you take without giving, you’re a mooch. If you keep track of everyone else’s taking and giving, you’re a creep scorekeeper. It’s our version of Christian guilt—it’s impious to feel good about your piety. You have to want to be good, but not feel good about how good you are. The worst thing is to be worrying about what someone else is doing, because that has nothing to do with whether you’re doing right.” — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=1462\">1462</a> ^ref-9576</p>\n<hr>\n<p>We both know plenty of read-only people who always say the same thing no matter what we say.” — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=2375\">2375</a> ^ref-49837</p>\n<hr>\n<p>“If you need to pay me to do math, that’s because a) you’ve figured out how to starve me unless I do a job, and b) you want me to do boring, stupid math with no intrinsic interest. A ‘job creator’ is someone who figures out how to threaten you with starvation unless you do something you don’t want to do. — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=3469\">3469</a> ^ref-21734</p>\n<hr>\n<p>“We have cultural as well as genetic traits. We pass them on. When we come up with a society like default, it selects for people who are wasteful jerks that succeed by stabbing their neighbors in the back, even though we’ve got a species-wide priority of not going extinct through environmental catastrophe, pandemic, and war.” — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=4345\">4345</a> ^ref-20711</p>\n<hr>\n<p>“I told myself I was making the world better. I thought there were ‘useful’ and ‘useless’ people and if you didn’t keep the useful people happy, the useless ones would starve. Of course I put myself in the useful group. I knew this important secret thing about useless and useful people, and if that’s not useful, what is? I told myself I was making more of everything for everyone. We just needed to let people who were worth the most do whatever they wanted. It was fucked up. I fucked up. That’s what I’m trying to say sorry for.” — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=4682\">4682</a> ^ref-19864</p>\n<hr>\n<p>Bit by bit, she learned to surf the moods. She recognized the furies as phenomena separate from objective reality. They were real. She really felt them. They weren’t triggered by any real thing in the world where everyone else lived. They were private weather, hers to experience alone or share with others as she chose. She treasured her weather and harnessed her storms, turning into a dervish of productivity when the waves crested; using the troughs to retreat and work through troubling concepts. — location: <a href=\"kindle://book?action=open&#x26;asin=B01FQQ47OC&#x26;location=5308\">5308</a> ^ref-8413</p>\n<hr>",
  "modified": "2022-12-23T16:25:40.000Z",
  "description": "",
  "dek": "",
  "url": "",
  "tags": [
    "activism",
    "culture"
  ],
  "hidden": false,
  "draft": false,
  "wordCount": 611,
  "readingTime": 3,
  "imageCount": 0,
  "linkCount": 10,
  "share": true
}