{
  "slug": "reading/Murphy-Hiscock-The Green Witch-1695005068861",
  "title": "The Green Witch",
  "date": "2025-01-21T19:39:25.382Z",
  "type": "reading",
  "html": "<h1 id=\"the-green-witch\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#the-green-witch\"><span class=\"icon icon-link\"></span></a>The Green Witch</h1>\n<h2 id=\"metadata\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#metadata\"><span class=\"icon icon-link\"></span></a>Metadata</h2>\n<ul>\n<li>Author: <a href=\"https://www.amazon.comundefined\">Arin Murphy-Hiscock</a></li>\n<li>ASIN: B071XSVBQC</li>\n<li>ISBN: 150720471X</li>\n<li>Reference: <a href=\"https://www.amazon.com/dp/B071XSVBQC\">https://www.amazon.com/dp/B071XSVBQC</a></li>\n<li><a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC\">Kindle link</a></li>\n</ul>\n<h2 id=\"highlights\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#highlights\"><span class=\"icon icon-link\"></span></a>Highlights</h2>\n<p>Despite its so-called progress, our modern society tends to look back to a simpler time, even though pioneer days were probably harder and more isolated than life today. This yearning isn’t nostalgia, which is a longing for an airbrushed memory. It is a genuine subconscious draw to knowledge that has been obscured by innovation, progress, and improvement. We don’t need to remove or reverse modern innovation and give up our sidewalks and television sets and computers. What we need to do is discover how to connect in our modern environment to that earlier knowledge that is waiting for us to find it again. — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=204\">204</a> ^ref-47217</p>\n<hr>\n<p>Whereas alternative religions promote the idea that humanity is a steward or custodian of the planet, the green witch understands that she is the manifestation of the earth itself, not merely a caretaker. That close sense of identification allows her to work in partnership with the earth’s energies. — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=221\">221</a> ^ref-59239</p>\n<hr>\n<p>If you live in Massachusetts, for example, and then move to New Mexico, your practice will shift as you adapt to your new environment, the new flora and fauna around you, and the new energies of the landscape. You yourself will adapt as well. As you settle into a new relationship with the earth as it manifests in New Mexico, you will discover yourself evolving to reflect it in a different fashion than you reflected the environment of Massachusetts. — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=245\">245</a> ^ref-12424</p>\n<hr>\n<p>you carry a sacred responsibility not only to watch over the harmony of your environment, but also to remember that, as author Poppy Palin says in Craft of the Wild Witch, “every positive gesture has the potential to become a spell.” — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=275\">275</a> ^ref-39055</p>\n<hr>\n<p>There are seven basic areas or energies on which the green witch’s practice focuses: 1. Harmony: within the self; between humanity and nature; between individuals; within a community or family 2. Health: of the body, mind, and spirit; of the immediate natural environment; of the larger environment 3. Love: for the self; for other individuals; for humanity 4. Happiness: in oneself; in others; in the natural world 5. Peace: within oneself; within a community or family; between factions; between nations 6. Abundance: personal; familial; community; nation; nature; also includes prosperity and fertility, both of which are aspects of abundance 7. Protection: personal; familial; community; nature — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=340\">340</a> ^ref-37369</p>\n<hr>\n<p>Loving others is an example of honoring and respecting nature and all nature’s creatures: it is an act of honoring their very existence and their place within nature’s energy. — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=376\">376</a> ^ref-23134</p>\n<hr>\n<p>Recording what you learn and do means that your information will probably be organized by date. You will thus remember and understand what you did when and why; the journal provides a context for your evolution. Don’t worry about the apparent mishmash of subjects you write about. — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=424\">424</a> ^ref-59423</p>\n<hr>\n<p>If you live in an urban setting, then that city’s energy is the energy to which you must open yourself in order to be in tune with your neighborhood and your environment. It is crucial to interact with your natural environment as it actually is, not the nature you imagine or idealize. — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=760\">760</a> ^ref-35323</p>\n<hr>\n<p>• How do the seasons change where you live? What changes can you see and feel? • What influence does the moon have on you? What is the phase of the moon right now? • What wild plants are common to your neighborhood? Name at least ten local plants. • Of those ten plants, which are indigenous to your area and which were imported? When were they imported and by whom? • What trees are most commonly found in your neighborhood? Again, which are indigenous and which were deliberately introduced? When and by whom? • What wildlife is native to your area? • Is the water that’s channeled to your tap hard or soft? • What type of soil does your neighborhood have? Is it chalky, clay, sandy, or other? Is it alkaline or acidic? — location: <a href=\"kindle://book?action=open&#x26;asin=B071XSVBQC&#x26;location=765\">765</a> ^ref-36435</p>\n<hr>",
  "modified": "2025-01-21T19:39:25.382Z",
  "description": "",
  "dek": "",
  "url": "",
  "tags": [
    "nature",
    "ecology",
    "health",
    "meditation"
  ],
  "hidden": false,
  "draft": false,
  "wordCount": 709,
  "readingTime": 3,
  "imageCount": 0,
  "linkCount": 11,
  "share": true
}