{
  "frontmatter": {
    "dek": "In which the author tries to put good food in his body",
    "inprogress": true,
    "date": "2022-12-28T18:20:58.000Z",
    "modified": "2024-05-15T18:02:51.000Z",
    "tags": [
      "food",
      "cooking",
      "recipe",
      "health"
    ],
    "hidden": false,
    "draft": false
  },
  "content": "## Food\n\nThis article focuses on ingredients and a balanced diet. For information on heating, combining, and serving, see [[cooking]]\n\nMy approach to food emphasizes meat-free whole foods and keeping good food around instead of counting every calorie.\n\nMuch like wearing a uniform might save cognitive overhead of choosing an outfit every day, having a limited menu of go-tos that are always stocked is [[step-zero]] for eating well.\n\nBecause I am often cooking for one and don't really enjoy leftovers, a lot of this is oriented around cooking or assembling single meals fresh to eat immediately.\n\n### Breakfast\n\nTim Ferris writes in the 4-hour body about the importance of getting protein into your body in the morning, ideally 30 minutes after waking.\n\n#### Greek Yogurt & Granola\n\nGreek yogurt and granola is a great breakfast option because it's packed with protein, healthy fats, and complex carbohydrates. Greek yogurt is high in protein, which will keep you full for longer and provide energy throughout the day. Granola is a great source of complex carbohydrates, which will give you sustained energy and help you stay alert and focused.\n\n#### Oatmeal & Granola\n\nOatmeal and granola is a delicious and healthy breakfast option. Oatmeal is a great source of complex carbohydrates and fiber, which will give you sustained energy and keep you full until lunchtime. Granola adds a crunchy texture and a boost of protein and healthy fats.\n\n#### Toast & Greek Yogurt\n\nI first had this at the Samovar Lounge in Yerba Buena Park. It was simple and yet extraordinarily delicious and decadent: a thick slice of sourdough with fresh, thick greek yogurt, topped with honey, olive oil, and big flakes of sea salt. It is a simple and luxurious breakfast.\n\n#### Eggs & Toast\n\nEggs and toast is a classic breakfast combination that is quick, tasty, and nutritious. Eggs are a great source of protein, while the toast provides complex carbohydrates for sustained energy. I usually add some hot sauce or chili oil.\n\n#### Hardboiled Eggs\n\nHardboiled eggs are a great breakfast option if you're short on time or don’t want to make dishes. They're a great source of protein and can be eaten alone or paired with toast or a piece of fruit. Hardboiled eggs can also be pre-cooked on the weekend and stored in the fridge for a quick and easy breakfast during the week.\n\n### Lunch\n\nLunch is an important meal of the day and should include a balance of protein, carbohydrates, and healthy fats. Salads are a great lunch option because they can be customized with a variety of ingredients and flavors. Here are some ingredients to consider when making a salad: lettuce, protein, toppings, and dressings.\n\nWhat should I have for lunch? Just have a salad. Its not that complicated.\n\n#### Salad\n##### Lettuce\n- Baby Spinach\n- Romaine\n- Spring greens\n##### Protein\n- Chickpeas\n- Black beans\n- Pre-cooked chicken\n- Pre-cooked fish\n- Tofu\n- Hardboiled eggs\n##### Toppings\n- Sliced cucumber\n- Tomatoes\n- Sliced purple cabbage\n- Sprouts (sunflower, alfalfa, arugula)\n- Sliced citrus (oranges, mandarins, apples)\n##### Dressings\n- Ceasar\n- Oil & Vinegar\n- Greek Yogurt\n\n### Dinner\n\n[[cooking-ramen-experiments]]\n\n### Desserts\n#### Chocolate chip cookies\n\n[[chocolate-chip-cookies]]\n\n#### Kolaches\n\n[[cooking-kolaches]]\n"
}