{
  "slug": "2023/design-philosophy",
  "title": "My design philosophy",
  "date": "2023-01-19T06:23:52.000Z",
  "type": "post",
  "html": "<h2 id=\"my-design-philosophy\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#my-design-philosophy\"><span class=\"icon icon-link\"></span></a>My design philosophy</h2>\n<p>Deeply intertwined at the heart of my design philosophy are both Design Thinking and Minimalism, setting the foundation for an approach that champions user needs and simplicity above all else.</p>\n<p>By sharply focusing on core essentials and vigorously eradicating unnecessary distractions, I'm dedicated to constructing designs that emanate clarity and facilitate easy interaction. Often this hyper focus is most beneficial in times when speed is prized, resources are short, and new un-tested technologies are being explored.</p>\n<p>My adherence to Design Thinking guarantees that user needs guide my designs, whereas my minimalist inclinations work to keep the experience straightforward and uncluttered. I see constraints not as barriers, but as springboards for creative solutions, and I thrive with short feedback loops and tight deadlines.</p>\n<p>See also [[how-to-run-a-project]] and [[joy-driven-development]]</p>\n<h3 id=\"simplicity--minimalism\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#simplicity--minimalism\"><span class=\"icon icon-link\"></span></a>Simplicity &#x26; Minimalism</h3>\n<p>At the core of my design philosophy lies simplicity and minimalism. By focusing on essential elements and stripping away everything else, I strive to create designs that are clean, intuitive, and easy to navigate. This approach ensures that users can quickly grasp the purpose of a design and interact with it seamlessly, and increases the speed of development.</p>\n<h3 id=\"universal-application-across-diverse-mediums\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#universal-application-across-diverse-mediums\"><span class=\"icon icon-link\"></span></a>Universal Application Across Diverse Mediums</h3>\n<p>The principles of simplicity, minimalism, and functionality are universal and can be applied across various mediums—from print to digital design. By adhering to these core tenets, I can create cohesive designs that are visually appealing, user-friendly, and effective in conveying their intended message.</p>\n<h3 id=\"phases-of-the-design-process\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#phases-of-the-design-process\"><span class=\"icon icon-link\"></span></a>Phases of the Design Process</h3>\n<p>My design process typically unfolds in several phases:</p>\n<ol>\n<li>Research &#x26; Discovery: Understanding the project requirements, target audience, and prior work.</li>\n<li>Ideation &#x26; Sketching: Brainstorming ideas and sketching out concepts on paper.</li>\n<li>Digital Mockups: Translating sketches into digital mockups using Figma, Illustrator, After Effects, or by writing code.</li>\n<li>Refinement &#x26; Iteration: Refining designs based on feedback and testing.</li>\n<li>Finalization &#x26; Handoff: Preparing final assets for development and writing tickets with engineers during implementation.</li>\n</ol>\n<h3 id=\"paper--sketching\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#paper--sketching\"><span class=\"icon icon-link\"></span></a>Paper &#x26; Sketching</h3>\n<p>Before diving into digital tools, I often begin my design process with paper and sketching. This tactile approach allows me to explore ideas more freely, experiment with different layouts, and quickly iterate on concepts without being constrained by technology.</p>\n<h3 id=\"using-grids\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#using-grids\"><span class=\"icon icon-link\"></span></a>Using Grids</h3>\n<p>Grids are an essential tool. They provide structure and consistency across different elements within a design while ensuring proper alignment and spacing. They also allow you to move quickly with confidence. By adhering to a grid system, I can create visually balanced compositions that are both aesthetically pleasing and functional.</p>\n<h3 id=\"designer-hat-vs-engineer-hat\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#designer-hat-vs-engineer-hat\"><span class=\"icon icon-link\"></span></a>\"Designer Hat\" Vs \"Engineer Hat\"</h3>\n<p>As a designer, it's important to be able to switch between the \"designer hat\" and the \"engineer hat.\" This means being able to think both creatively and analytically, considering not only the visual aspects of a design but also its functionality and feasibility from an engineering perspective.</p>\n<h3 id=\"the-power-of-constraints\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#the-power-of-constraints\"><span class=\"icon icon-link\"></span></a>The Power of Constraints</h3>\n<p>A central tenet in my design philosophy is the Power of Constraints. When we face limitations in our design process, instead of viewing them as stifling roadblocks, I consider them a unique source of inspiration. Constraints challenge us to work within our means and bring out the best from what we have at hand.</p>\n<h4 id=\"save-colors-for-information\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#save-colors-for-information\"><span class=\"icon icon-link\"></span></a>Save Colors for Information</h4>\n<p>Colors can be powerful tools for conveying information in a design. However, using too many colors can lead to visual clutter and confusion. I believe in using colors sparingly and purposefully—reserving them for key elements or to highlight important information.</p>\n<h4 id=\"red-white-and-black\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#red-white-and-black\"><span class=\"icon icon-link\"></span></a>Red, White, and Black</h4>\n<p><a href=\"https://gwern.net/red\">Red, white, and black</a> are classic colors that form the foundation of my design palette. These timeless hues work harmoniously together while providing ample contrast for readability. By starting with this versatile trio, I can build upon it with additional colors when necessary.</p>\n<h3 id=\"iterative-process\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#iterative-process\"><span class=\"icon icon-link\"></span></a>Iterative process</h3>\n<p>The iterative process is essential for a few reasons:</p>\n<ol>\n<li>\n<p><strong>User-Centric Design:</strong> It enables a design to be refined continuously based on actual user feedback, keeping the design centered around the user's needs.</p>\n</li>\n<li>\n<p><strong>Risk Reduction:</strong> Regular testing can catch and fix problems early, thus minimizing the risk of costlier changes later in development.</p>\n</li>\n<li>\n<p><strong>Continual Improvement:</strong> The cycle allows for continuous refinement, meaning the design can evolve and adapt as more is learned about users and their needs.</p>\n</li>\n</ol>\n<p>Alternatives to iterative design could include the Waterfall Model or Big Design Up Front (BDUF).</p>\n<p>The <em>Waterfall Model</em> is a linear approach where one phase must be completed before moving on to the next. It can be appropriate when requirements are well-understood in advance, changes are unlikely, and the project is relatively simple.</p>\n<p><em>Big Design Up Front</em> involves spending considerable time on designing the entire system in detail before implementation begins. It's appropriate when there is a clear and unchanging understanding of requirements, though this is rare in practice.</p>\n<p>However, both alternatives have their limitations. They often fail to account for changing user needs or unexpected issues arising during development. Hence, they may not yield designs as user-friendly or effective as an iterative approach would.</p>\n<h3 id=\"proscons-of-designing-in-code\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#proscons-of-designing-in-code\"><span class=\"icon icon-link\"></span></a>Pros/Cons Of Designing in Code</h3>\n<p>Designing in code offers several advantages, such as rapid prototyping and easy collaboration with developers. However, it can also be limiting in terms of creative freedom and may require more time to make adjustments compared to using design software. I believe in striking a balance between designing in code and utilizing design tools, depending on the specific needs of a project.</p>",
  "modified": "2024-09-20T04:26:18.000Z",
  "description": "",
  "dek": "In which we create a few rules so we can fully unlock our creativity",
  "url": "",
  "tags": [
    "design"
  ],
  "hidden": false,
  "draft": true,
  "wordCount": 902,
  "readingTime": 4,
  "imageCount": 0,
  "linkCount": 1,
  "share": true
}