{
  "slug": "2023/starting-a-studio-introducing-room-302",
  "title": "Introducing room302.studio",
  "date": "2023-04-10T05:00:00.000Z",
  "type": "post",
  "html": "<h2 id=\"introducing-room302studio\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#introducing-room302studio\"><span class=\"icon icon-link\"></span></a>Introducing room302.studio</h2>\n<p>It's been a long journey since I first started in data visualization contracting over ten years ago, and <strong>I'm incredibly proud to introduce my new data and prototyping studio: <a href=\"https://room302.studio\">Room 302 Studio</a>.</strong></p>\n<p>As my client work grew larger and more intricate, I realized the tremendous potential of forming a studio where talented people could connect, collaborate and strive together towards empowering the world through projects and tools that center joy and kindness. This dynamic new studio sets up an exciting opportunity for each of us to take on more ambitious projects that reflect our strong values.</p>\n<p>We just published one of our first projects and I've done a tremendous amount of work to be able to say: we are open for business!</p>\n<h3 id=\"hire-us\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#hire-us\"><span class=\"icon icon-link\"></span></a>Hire us</h3>\n<p>We are booking client work today. Reach out to <a href=\"mailto:studio@room302.studio\">studio@room302.studio</a> with an idea, dataset, or prototype you want to talk about.</p>\n<p>At Room 302 Studio, we offer a range of services that cater to different needs and project types:</p>\n<ol>\n<li><strong>Data Visualization and Exploration</strong>: Transform complex data into visually engaging and easy-to-understand websites, D3 visualizations, or Observable Notebooks that effectively communicate your insights internally or to the public.</li>\n<li><strong>Prototyping</strong>: Turn your big ideas into tangible reality with high-quality prototypes that can be used for testing, refining concepts, and fundraising.</li>\n<li><strong>AI Consulting</strong>: Integrate generative text and image models into your work with the help of a team experienced in prompt engineering, embedding visualization, and the art and magic of speaking to robots.</li>\n<li><strong>Workshops &#x26; Events</strong>: Participate in interactive learning sessions where you can acquire new skills, insights, and knowledge in various disciplines.</li>\n<li><strong>Cutting edge tech</strong>: We pride ourselves on adapting quickly, and enjoy pushing the limits of new tools and technologies. Use our team to QA your product, develop a library of demos, or create instructional content on things no one has ever seen before.</li>\n</ol>\n<h3 id=\"workshops-and-events\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#workshops-and-events\"><span class=\"icon icon-link\"></span></a>Workshops and Events</h3>\n<p>Room 302 Studio will be regularly hosting events in the coming year that promote learning, collaboration, and growth:</p>\n<ol>\n<li><em>Livestreams</em>: Collaborate on projects in public, stream live tutorials, give presentations or host Q&#x26;A sessions through livestreaming platforms like Twitch or YouTube. This will build on the incredible experience Ian and I had with <a href=\"https://www.youtube.com/playlist?list=PLI_sHchSmdCD0RximFqzqCOSqCgVWJpdA\">Coding with Fire</a></li>\n<li><em>Hackathons</em>: We are hoping to host fast-paced development sprints aimed at solving specific challenges within a limited timeframe.</li>\n<li><em>Knowledge Sharing</em>: Engage with leaders from various industries as they share their insights on emerging trends and technologies.</li>\n</ol>\n<h3 id=\"membership-options\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#membership-options\"><span class=\"icon icon-link\"></span></a>Membership Options</h3>\n<p>In addition to our consulting services, we have set up an accessible Discord community that allows members to tap into the studio, engage in thought-provoking discussions, and start collaborating on projects that make a genuine difference. I am really trying to focus on creating a space and sparking collaborations that center joy: [[joy-driven-development]]</p>\n<p>We offer two types of membership options depending on your needs:</p>\n<ol>\n<li><strong>Community Membership (Free)</strong>: Access our Discord community where you can engage with other members, participate in discussions on topics that interest you, attend virtual events, propose projects or collaborate on existing projects.</li>\n<li><strong>Studio Membership (Monthly Fee, Invite-Only)</strong>: This is for members who will be working on paid client work, and includes a studio email, project billing, and a number of internal tools, resources, datasets, and templates.</li>\n</ol>\n<p>I am beyond excited to see where this journey takes us, and I invite you to join us at Room 302 Studio as we collaborate, learn, and grow together. To learn more, visit our website at <a href=\"https://room302.studio/\">https://room302.studio/</a></p>",
  "modified": "2024-09-20T04:21:55.000Z",
  "description": "",
  "dek": "In which the author proudly presents his new venture: Room 302 Studio, an eclectic gathering of talent devoted to fostering joy-driven development",
  "url": "",
  "tags": [
    "data"
  ],
  "hidden": false,
  "draft": false,
  "wordCount": 588,
  "readingTime": 3,
  "imageCount": 0,
  "linkCount": 2,
  "share": true
}